{
    "The Alley": {
        "Iron Goddess Milk Tea": [
            {
                "reviewName": "Chrisoulla Rakowski",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "This place is another favorite of mine in Toronto for bubble tea. Their iron goddess tea is really good and isn't too sweet. I also recommend you try their deerioca fever. That's their signature with their brown sugar based tapioca pearls …"
            },
            {
                "reviewName": "Sanjeev Patra",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… The staff were very patient and explained in detail. We tried the Alley Trio Milk tea, Iron Goddess (stronger tea flavor) with coffee tapioca, guava lime juice and the northern lights. The last two are fruit juices but very good with …"
            },
            {
                "reviewName": "David T",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… I tried the iron goddess milk tea which tastes like oolong, it's a solid drink. But I heard the Royal 9 was the one to try, so I'll try that next time. …"
            },
            {
                "reviewName": "Tina Ye",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… . Always very impressed with the interior decor of the place. They have a great selection of drinks (I do actually really recommend trying their traditional chinese tea items like \"Iron Goddess Tea\"; they make it pretty authentically here). …"
            },
            {
                "reviewName": "Ioanna M.",
                "reviewRating": 3,
                "reviewDate": "3 years ago",
                "reviewMessage": "I got the Iron Goddess and it was okay. I wasn’t so impressed to be honest. The tapioca was good not as flavourful and the staff was good and fast. Next time I’ll try the royal No9 milk tea I tried a sample and it tasted better than the …"
            },
            {
                "reviewName": "AL",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… teas around. One of the downsides is that their tea names are not very descriptive at al, and the names are really vague! No one really knows what Royal No. 9 or Iron Goddess milk tea means! But my goodness are they delicious. Royal No. 9 …"
            },
            {
                "reviewName": "Maria Karcz",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… and extremely helpful stuff. You really get the quality that you pay for...milk always tastes fresh for the fresh milk teas and the tea is always strong, not that watered down stuff you sometimes get at chatime. Expect to pay 50 cents …"
            },
            {
                "reviewName": "A Cartier",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… nice light and higher ceilings. It has a fair amount of seating if you want to enjoy your tea there and even the take out area wouldnt be too crowded since it's wider than the 3 other nearby bubble tea places. The aesthetics is a-dork-able …"
            },
            {
                "reviewName": "Rhythmless",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "A small and quiet place to have a drink and meet people. I got the iron goddess milk tea at a friends suggestion and enjoyed it. Place was clean and furnished nicely, quality was better than many places I've been to."
            },
            {
                "reviewName": "C Jordan",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Such a charming little bubble tea shop with a chill vibe and good music. Love the decor and the iron goddess milk tea. Best grass jelly I've had in ages."
            },
            {
                "reviewName": "Sue Kwong",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Their warm, delicious Iron Goddess milk tea that hit the spot on a chilly night. It was smooth, still quite sweet despite ordering less sweet, couldn't detect any unbearable bitterness from the tea. My only mistake was drinking it too late …"
            },
            {
                "reviewName": "Maria Greco",
                "reviewRating": 1,
                "reviewDate": "2 years ago",
                "reviewMessage": "Used to love this place and went all the time with friends! Tonight I asked for an iron goddess tea with added almond milk. The lady taking my order gladly agreed. When I received my drink it was black tea without milk. I asked if she could …"
            },
            {
                "reviewName": "Jerome Tham",
                "reviewRating": 5,
                "reviewDate": "7 months ago",
                "reviewMessage": "Iron goddess milk tea, deerioca fresh milk"
            },
            {
                "reviewName": "Vannesa Szeto",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "My favourite bbt.  Iron Goddess Milk Tea with grass jelly."
            }
        ],
        "Royal No.9 Milk Tea": [
            {
                "reviewName": "Christelle Tan",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "The Royal No. 9 milk tea was really good! Highly recommend. It was about $6 for a small with tapioca. The place was pretty busy and crowded when we went on Sunday afternoon. The staff were very friendly and offered suggestions when we …"
            },
            {
                "reviewName": "Jonathan Tsugawa",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… lovely bubble tea shop with great aesthetic and even greater bubble tea. Their specialty bubble teas such as the \"Royal No.9\" and \"Garden Milk tea\" are delicious and unique. The staff is very friendly, the sugar options are true to the …"
            },
            {
                "reviewName": "Mochi Mochi",
                "reviewRating": 3,
                "reviewDate": "a year ago",
                "reviewMessage": "… left out too long). Besides the tapiocas being mediocre, they have some good flavours. I tried a lot of varieties but my favourite is their popular deerioca fever, Royal No. 9 Milk Tea and Alley Trio Milk Tea. I also like their decor and …"
            },
            {
                "reviewName": "AL",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Delicious bubble tea place in a cozy, comfortable setting. It isn't the easiest to find; it's tucked right behind Aroma, right around the corner. …"
            },
            {
                "reviewName": "Jessica Xiong",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Loved their royal no. 9 milk tea with pudding! It had this unique blueberry aftertaste. The jamsine milk tea was also great. Service was great and we didn't want for too long. A bit expensive but it's worth it!"
            },
            {
                "reviewName": "A Cartier",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… nice light and higher ceilings. It has a fair amount of seating if you want to enjoy your tea there and even the take out area wouldnt be too crowded since it's wider than the 3 other nearby bubble tea places. The aesthetics is a-dork-able …"
            },
            {
                "reviewName": "Jay",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "The downtown is continuing to sprout up bubble tea shops to satisfy the milk tea cravings of the masses. The Alley is another contender that has appeared just south of Yonge and Bloor, hidden inside the lobby level of a condo. How lucky for …"
            },
            {
                "reviewName": "Clam",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… I tried the Markham location a while back and didn't think too much of it. But having tried a different location, can definitely say I'm a fan. I really like royal no.9. Tastes really unique. I haven't tried any other type consistently. Ba …"
            },
            {
                "reviewName": "Draecastro",
                "reviewRating": 2,
                "reviewDate": "4 years ago",
                "reviewMessage": "… One would think that they would have a faster service because they have tons more space and more people working but nope. It took 10 minutes to make 1 Royal No. 9 and 1 Alley Trio. They were also very snobby with their noses up in the air. …"
            },
            {
                "reviewName": "A n",
                "reviewRating": 2,
                "reviewDate": "4 years ago",
                "reviewMessage": "Want to love this place, aesthetics are definitely on point, however I found hair in my Royal no.9 milk tea."
            },
            {
                "reviewName": "sayo",
                "reviewRating": 4,
                "reviewDate": "2 years ago",
                "reviewMessage": "First time to have The Alley’s bubble tea! I had Royal No.9 Milk tea, which many people recommend on the reviews, with less sugar and less ice while watching the movie. It’s very flavorful and sweetness is perfect for me. Tapioca is tasty …"
            },
            {
                "reviewName": "Gerald Tan",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "… came with pearls and bunch of other jelly things in it which had all sorts of flavors and textures. A little pricey like most milk tea places. I also like the royal no. 9 that has a unique flavor to it. I think its bluberry but im not sure."
            },
            {
                "reviewName": "Yuting Zhu",
                "reviewRating": 4,
                "reviewDate": "8 months ago",
                "reviewMessage": "They got my drink wrong but was able to switch it to the right one immediately! Always the fan of their Royal No 9 milk tea!"
            }
        ],
        "Alley Trio Milk Tea": [
            {
                "reviewName": "Sanjeev Patra",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… The staff were very patient and explained in detail. We tried the Alley Trio Milk tea, Iron Goddess (stronger tea flavor) with coffee tapioca, guava lime juice and the northern lights. The last two are fruit juices but very good with …"
            },
            {
                "reviewName": "Clark Mercado",
                "reviewRating": 2,
                "reviewDate": "2 years ago",
                "reviewMessage": "… Late into the night I order for a large The Alley Trio, half sugar and less ice. The boba itself was mediocre, it could have been the ingredients or the tearista, but the end product was decent. I asked for half sugar but ended up with …"
            },
            {
                "reviewName": "Mochi Mochi",
                "reviewRating": 3,
                "reviewDate": "a year ago",
                "reviewMessage": "… ). Besides the tapiocas being mediocre, they have some good flavours. I tried a lot of varieties but my favourite is their popular deerioca fever, Royal No. 9 Milk Tea and Alley Trio Milk Tea. I also like their decor and it’s cozy in there."
            },
            {
                "reviewName": "Oliver Bernabe",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "One of the best boba places in the city! My go to drink here is the Alley Trio (milk tea w/ jelly, tapioca pearls and pineapple). Initially thought the combination was weird, but put it all together and it’s pretty damn good. …"
            },
            {
                "reviewName": "Draecastro",
                "reviewRating": 2,
                "reviewDate": "4 years ago",
                "reviewMessage": "… One would think that they would have a faster service because they have tons more space and more people working but nope. It took 10 minutes to make 1 Royal No. 9 and 1 Alley Trio. They were also very snobby with their noses up in the air. …"
            },
            {
                "reviewName": "Marina Popovic",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Delicious tea, very fresh tapioca and jelly. I've tried the Iron Goddess Milk Tea and The Alley Trio and they were both amazing."
            }
        ],
        "Brown Sugar Deerioca": [
            {
                "reviewName": "Amanda P",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "This is the best freakin' bubble tea I've had.\nDeerioca with soy milk is my shiiiiit.💜😍😎\nFun & satisfying to drink.\nCold soy milk, warm brown sugar and the soft, chewy pearls adds layers of texture and contrast.\nSupe …"
            }
        ],
        "Deerioca Fever": [
            {
                "reviewName": "Eckogen",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… my #1 spot for boba. The Deerioca series bubble tea is to die for. It's made with brown sugar, fresh milk, and brown sugar soaked tapioca. Sounds simple, but the flavors are explosively delicious. I recommend trying the Deerioca Fever or …"
            },
            {
                "reviewName": "Chrisoulla Rakowski",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… good and isn't too sweet. I also recommend you try their deerioca fever. That's their signature with their brown sugar based tapioca pearls with the fresh milk. It's a good mix of mild with sweetness. I also tried their northern lights …"
            },
            {
                "reviewName": "Cat N",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… the staff was patient enough to explain some drinks despite a lineup building. Strawberry lulu drink is delicious. Strawberry lovers paradise. The deerioca fever is also pretty amazing. Brown sugar warm tapioca. Mmmm. Highly recommended."
            },
            {
                "reviewName": "Lucas",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Really awesome bubble tea. I really love the Deerioca Fever, hot, with soy milk. It tastes amazing. It's a brown sugar milk tea. They usually run out of the stuff, so order while you can."
            },
            {
                "reviewName": "EnKaye Media",
                "reviewRating": 3,
                "reviewDate": "4 years ago",
                "reviewMessage": "Quaint atomosphere, great service, Brown Sugar Deerioca drink was well made and tasted great on a hot day! Would rate it higher if the WiFi was working the day I went in, wasn't able to be as productive as I'd have liked. I implore you to …"
            },
            {
                "reviewName": "Dawn Blair",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "My favourite bubble tea shop! The brown sugar deerioca is the best!"
            },
            {
                "reviewName": "seawwwd",
                "reviewRating": 5,
                "reviewDate": "4 months ago",
                "reviewMessage": "… to a level above Chatime or Coco. There are less options than a Chatime however, the flavours that are available are all of quality. The of the flavours being Royal no9, Iron Goddess and I have heard people like the Deerioca Fever. …"
            },
            {
                "reviewName": "Lam Lam",
                "reviewRating": 1,
                "reviewDate": "a year ago",
                "reviewMessage": "I always order deerioca fever but this time the drink is so watered down.\nI order hot deerioca with soy milk and milk , It has no soy milk/ milk taste in it. It just taste like hot water mix brown sugar."
            },
            {
                "reviewName": "Jessica Chen",
                "reviewRating": 1,
                "reviewDate": "2 years ago",
                "reviewMessage": "Ordered the deerioca fever and the tapioca was not thoroughly cooked??? It was super tough and hard to chew on. I honestly not get the hype.  I tried the alley a couple years ago and did not like it. Nothing special just very basic bbt.  I …"
            },
            {
                "reviewName": "Peter C",
                "reviewRating": 1,
                "reviewDate": "6 months ago",
                "reviewMessage": "This franchise location is not good and tea tasted funny.  Also didn't have their #1 deerioca fever drink available at noon cause it was still being prepared???"
            },
            {
                "reviewName": "A HM",
                "reviewRating": 1,
                "reviewDate": "2 years ago",
                "reviewMessage": "Got the deerioca puff and also tried my friend's deerioca fever.. both were basically just milk."
            },
            {
                "reviewName": "Robert Skoczen (lackofspark)",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "deerioca fever is all you need. Warm sweet peels with cold drink on top"
            }
        ],
        "Jasmine Green Milk Tea": [
            {
                "reviewName": "Andrea Pineda",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Had the jasmine milk green tea with tapioca and it was bomb! This location is so instagrammable so make sure to take many photos with your bubble tea. Service was super friendly and quick, I had to wait less than 5 min for my tea"
            },
            {
                "reviewName": "A Cartier",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… nice light and higher ceilings. It has a fair amount of seating if you want to enjoy your tea there and even the take out area wouldnt be too crowded since it's wider than the 3 other nearby bubble tea places. The aesthetics is a-dork-able …"
            },
            {
                "reviewName": "Elizabeth Scovell",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "i got the jasmine green milk tea with bobas and i want to go back for more asap! really really adorable interior, and a cute little woodsy animal theme... i didnt really pay attention to the staff or the wait times but really enjoyed the …"
            },
            {
                "reviewName": "Sima Hosseinzadeh",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "I got so impressed by their Jasmine green tea + soy milk with aloe topping! Yum! Such a great combination. I would strongly recommend this place for all tea lovers! Friendly staff and lovely atmosphere to sit in and enjoy your time ."
            },
            {
                "reviewName": "Sarah Q.",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "The Alley has officially taken #1 position in my heart for best boba! My mom and I love their whole milk tea series, but the jasmine green milk tea and royal no. 9 milk tea are our favorite."
            }
        ],
        "Garden Milk Tea": [
            {
                "reviewName": "Rachel Black",
                "reviewRating": 4,
                "reviewDate": "3 months ago",
                "reviewMessage": "… . They have adjusted their menu over time, adding new drinks like their Snow Velvet and Crunchy series. Unfortunately, they removed their Garden Milk Tea from the menu which had crumbled Oreo topping that I considered as an Alley classic."
            },
            {
                "reviewName": "Hef M",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "… Joseph one, and they have lovely staff! Very helpful as well,the drinks are always made fast and they are very yummy and unique! I also love playlist they have there 10/10 if you have a sweet tooth like me I recommend the garden milk tea :)"
            },
            {
                "reviewName": "Jonathan Tsugawa",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… lovely bubble tea shop with great aesthetic and even greater bubble tea. Their specialty bubble teas such as the \"Royal No.9\" and \"Garden Milk tea\" are delicious and unique. The staff is very friendly, the sugar options are true to the …"
            }
        ],
        "Morning Dawn": [],
        "Deerioca Matcha": [
            {
                "reviewName": "Ana G",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… They are very professional and Wilson (I hope that's his right name) took care of us and provide a great customer service. \"Apple of my eye\" & \"Morning Dawn\" are our favorites. Great quality from the products to the customer service. Good …"
            },
            {
                "reviewName": "Payment Bunny",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Morning Dawn is the best, hands down"
            }
        ],
        "Passion Fruit Green Tea": [
            {
                "reviewName": "Lauren Selwyn",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… the range of delicious tea and topping options. I would recommend trying to arrive at a quiet time as there are really great seating areas but they always seem to be full. try the royal number 9 with pearls or the passion fruit green tea!"
            },
            {
                "reviewName": "Narges Gholizadeh",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "I tried passion fruit green tea and it tasted just like as real tea. You can ask for less sugar so it tastes really fresher and summery."
            },
            {
                "reviewName": "Tim Cho",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "I got the Deerioca Matcha - a matcha topped brown sugar fresh milk tea. Wasn't too heavy or sweet, but rather a great combination of two flavors making it one of my favorites from The Alley."
            },
            {
                "reviewName": "C",
                "reviewRating": 1,
                "reviewDate": "a year ago",
                "reviewMessage": "Lol my tapioca was rock hard in my matcha deerioca. Other times I’ve tried this place it was subpar but this time it was straight up nasty."
            }
        ],
        "Classic Milk Tea": [
            {
                "reviewName": "Rachel Black",
                "reviewRating": 4,
                "reviewDate": "3 months ago",
                "reviewMessage": "… . They have adjusted their menu over time, adding new drinks like their Snow Velvet and Crunchy series. Unfortunately, they removed their Garden Milk Tea from the menu which had crumbled Oreo topping that I considered as an Alley classic."
            },
            {
                "reviewName": "Victoria Reedman",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "… The Deerioca is good but too sugary for my taste. For the classic Milk Tea with tapioca with less sugar, something about the flavour wasn't as strong as I would've liked. I think it's all about personal preference for bubble tea though. St …"
            },
            {
                "reviewName": "Alina WL",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "I'm not a huge bubble tea person but I really enjoyed their Passion fruit Green Tea and my friend crunch strawberry milk drink !\nThe staff was really kind and answered any questions that we had!"
            }
        ],
        "Hojicha": [
            {
                "reviewName": "Sanjana Sridhar",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "I really like the deerioca and the hojicha latte.  Their tapioca us usually great but if you go late night it might not always be the best but it usually depends on the day though. Great place to kinda just hang out with friends. Gets …"
            },
            {
                "reviewName": "Doris Chu",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "The hojicha latte that I ordered was good, I don't normally find this item in the menu in other bubble tea shops."
            },
            {
                "reviewName": "Amelia Baxter",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "I really liked the Hojicha tea with soy milk, not too sweet."
            }
        ],
        "Sweet Dew Fresh Milk Tea": [
            {
                "reviewName": "Dana Sullivan",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "They have an interesting, unique menu - I've tried the Sweet Dew Fresh Milk Tea and Brown Sugar Ginger Tea. Their drinks have a good, fresh taste, and the ginger tea in particular had a strong authentic ginger flavour. Their tapioca is made …"
            }
        ],
        "Brown Sugar Bubble Tea": [
            {
                "reviewName": "Yousra Moghani",
                "reviewRating": 4,
                "reviewDate": "10 months ago",
                "reviewMessage": "We always heard about the Alley! As one of the best bubble tea shops, we tried their #1 popular drink (brown sugar derioca milk tea) and snow velvet muscat black tea. I imagined the taste would be better but maybe I didn't know what to …"
            },
            {
                "reviewName": "Big Nate",
                "reviewRating": 5,
                "reviewDate": "5 months ago",
                "reviewMessage": "Very tasty bubble tea! I tried their special brown sugar infused tapioca in a matcha drink which I was craving and it absolutely hit the spot. I wish they did a large though, the flavours my buddies had were good too. …"
            },
            {
                "reviewName": "Tian G",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Great bubble tea! Their brown sugar tapioca was fantastic! It was chewy, soft and of the right amount of sweetness! …"
            },
            {
                "reviewName": "Eckogen",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… my #1 spot for boba. The Deerioca series bubble tea is to die for. It's made with brown sugar, fresh milk, and brown sugar soaked tapioca. Sounds simple, but the flavors are explosively delicious. I recommend trying the Deerioca Fever or …"
            },
            {
                "reviewName": "Chrisoulla Rakowski",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… good and isn't too sweet. I also recommend you try their deerioca fever. That's their signature with their brown sugar based tapioca pearls with the fresh milk. It's a good mix of mild with sweetness. I also tried their northern lights …"
            },
            {
                "reviewName": "Shannon McIntosh",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Best boba I’ve ever had. The brown sugar is incredible and makes it taste sweet yet still has flavor. I’d definitely be a regular if I lived in Toronto. …"
            },
            {
                "reviewName": "Francesca Bouaoun",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "A lovely wee space (liked the indoor tree) with lots of options. Had a brown sugar 'deeroica' bubble tea on the recommendation of a friend and it perhaps the best bubble tea I've had! Fairly long line up as it was a busy weekend."
            },
            {
                "reviewName": "Belvina M",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… hip bubble tea shop. Really incentive flavours made with high quality tea. I ordered the Derrioca Matcha tea which is a matcha tea with brown sugar pearls. This is the most popular drink and for good reason. The tapioca is freshly made …"
            },
            {
                "reviewName": "Emma Field",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Really delicious. I had the brown sugar bubble tea, unfortunately I wasn't able to change the amount of ice in the drink but it was very tasty. Nice atmosphere."
            },
            {
                "reviewName": "Samantha Millar",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Best bubble tea I have ever had. The staff was super helpful when I was choosing between the puff and regular brown sugar bubble tea.. I decided to get both, and they weren't to sweet, were super creamy, and the warm brown sugar tapioca is …"
            },
            {
                "reviewName": "Dhruv Joshi",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "The bubble tea at The Alley was delicious. I had the brown sugar deeroica. The bubble tea wasn't super sweet, which is exactly how I preffered it. The tapoica was also made fresh and tasted fantastic. I would definitely check this out if …"
            }
        ],
        "Able Bubble Tea Cup Holder": [],
        "Deerioca Puff": [
            {
                "reviewName": "Eckogen",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… tea shop. I been to and tried many bubble tea places, but the Alley ranks as my #1 spot for boba. The Deerioca series bubble tea is to die for. It's made with brown sugar, fresh milk, and brown sugar soaked tapioca. Sounds simple, but …"
            },
            {
                "reviewName": "Elizabeth Vecchio",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… of flavors that no other shops have. And you can get your bubble tea with soy milk which no other shop provides. If you are okay with dairy, and have a sweet tooth, try the famous deerioca \"puff\". It's like drinking caramel coffee cake \ud83d …"
            },
            {
                "reviewName": "Tasmia Ahmed",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Best bubble tea in town. Deerioca series is a must try!! For sweet tooths I recommend Deerioca Puff, and Deerioca Fever for regular pearl milk tea lovers"
            },
            {
                "reviewName": "Nafisa Tabassum",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "Lovee the Deerioca Puff from here."
            },
            {
                "reviewName": "Richard Noun",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Amazing as always. Favourite bbt place in toronto. Recommend deerioca puff!!"
            }
        ],
        "Hot Milk Tea": [
            {
                "reviewName": "Ha Pham",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Another bubble tea shop in Toronto. …"
            },
            {
                "reviewName": "Deeksha Juneja",
                "reviewRating": 4,
                "reviewDate": "10 months ago",
                "reviewMessage": "… without milk which is a little disappointing. They also don't have popping bubbles. However, I keep going back because the tea quality and the variety overall is very good. Highly recommend it. I love how well they prepare their hot drinks."
            },
            {
                "reviewName": "Vincent Pun",
                "reviewRating": 4,
                "reviewDate": "10 months ago",
                "reviewMessage": "The Deerocia milk bubble tea is now the same taste as the original store which is the best bubble around. …"
            },
            {
                "reviewName": "L T",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… rich, milk tea that exceeds almost all others that I have tried.  I would recommend trying it hot as well and half-sweet or even 30% sweet as full strength sugar is VERY sweet. There is also limited seating so, if you want to stay, you may …"
            },
            {
                "reviewName": "Lucas",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Really awesome bubble tea. I really love the Deerioca Fever, hot, with soy milk. It tastes amazing. It's a brown sugar milk tea. They usually run out of the stuff, so order while you can."
            },
            {
                "reviewName": "Andrea",
                "reviewRating": 1,
                "reviewDate": "6 months ago",
                "reviewMessage": "I just bought 2 hot derioka fevers. But they gave me straws for cold bubble tea. I asked for a proper straw, but they said they don’t have it. Now, I have 2 derioka fevers, but I’m not able to drink them. It’s like I’m drinking milk, that’s …"
            },
            {
                "reviewName": "Robert Gallagher",
                "reviewRating": 2,
                "reviewDate": "a year ago",
                "reviewMessage": "Tea is good. Ordered 2 hot teas.\n\nThey WONT put milk in your black tea! How pompous are these people.\nI asked and got the reaction of  \"we have a set menu and thats it: Direct words.\n\nOur first time here. And definitely our last."
            }
        ]
    },
    "Icha Tea": {
        "Matcha Latte": [
            {
                "reviewName": "Angel Chan",
                "reviewRating": 4,
                "reviewDate": "2 months ago",
                "reviewMessage": "… place had a great atmosphere and the back is very spacious. The staff were also nice. I got the Matcha Latte and the Black Sesame Cheesecake and they were pretty good. I want to try their other items but so far, I had a great experience."
            },
            {
                "reviewName": "Kelly",
                "reviewRating": 4,
                "reviewDate": "a week ago",
                "reviewMessage": "… saw it was only here for a limited time & I love anything matcha-strawberry. My sister got their matcha latte and my friend got their mango green tea. You can definitely taste that the drinks are made with fresh & quality ingredients. My …"
            },
            {
                "reviewName": "Johnson",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "The classic milk tea and strawberry matcha latte were both very good. They have a specialized tea bar for those into that. The interior is very relaxing and would be a great place to study or relax. Employees were friendly and gave us our …"
            },
            {
                "reviewName": "T",
                "reviewRating": 5,
                "reviewDate": "a week ago",
                "reviewMessage": "All their drinks are amazing. You can’t go wrong with any of them! My personal favs are the rose jasmine milk tea, matcha latte, and fresh taro milk! …"
            },
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… around. Very clean and comfortable and great for hanging out. Aside from the interior, we got the classic milk tea with tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable …"
            },
            {
                "reviewName": "J. L",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… Matcha Latte: Not worth the $6.20. The matcha flavour is super diluted and just tastes like milk. I will say that the way they prepare the drink is great though since the matcha tasted smooth rather than powdery. …"
            },
            {
                "reviewName": "Grace K",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Great little tea shop, very cozy atmosphere. The Chrysanthemun pu er milk tea is really great, as well the Matcha latte is impressive. Back room is a large tea \"dining room\" of sorts and a small front patio to facilitate people watching."
            },
            {
                "reviewName": "Shailendra Shukla",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "I had Matcha latte, with a colleague and it was really tasty. A quarter sugar added the slight and perfected amount of sugar. I loved the way they prepared it in front of me and explained about it too. …"
            },
            {
                "reviewName": "Benjamin Wang (X.B.X)",
                "reviewRating": 5,
                "reviewDate": "a month ago",
                "reviewMessage": "Matcha latte with soy milk! Awesome!"
            },
            {
                "reviewName": "Melissa Wong",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Came in 30 mins before closing which is really too bad- this is the perfect little place to quietly write in my journal. I had a matcha latte and the tofu black sesame cheesecake! Sooooo yummy \ud83d …"
            },
            {
                "reviewName": "Angel Chan",
                "reviewRating": 4,
                "reviewDate": "2 months ago",
                "reviewMessage": "… place had a great atmosphere and the back is very spacious. The staff were also nice. I got the Matcha Latte and the Black Sesame Cheesecake and they were pretty good. I want to try their other items but so far, I had a great experience."
            },
            {
                "reviewName": "Kelly",
                "reviewRating": 4,
                "reviewDate": "a week ago",
                "reviewMessage": "… saw it was only here for a limited time & I love anything matcha-strawberry. My sister got their matcha latte and my friend got their mango green tea. You can definitely taste that the drinks are made with fresh & quality ingredients. My …"
            },
            {
                "reviewName": "Johnson",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "The classic milk tea and strawberry matcha latte were both very good. They have a specialized tea bar for those into that. The interior is very relaxing and would be a great place to study or relax. Employees were friendly and gave us our …"
            },
            {
                "reviewName": "T",
                "reviewRating": 5,
                "reviewDate": "a week ago",
                "reviewMessage": "All their drinks are amazing. You can’t go wrong with any of them! My personal favs are the rose jasmine milk tea, matcha latte, and fresh taro milk! …"
            },
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… around. Very clean and comfortable and great for hanging out. Aside from the interior, we got the classic milk tea with tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable …"
            },
            {
                "reviewName": "J. L",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… Matcha Latte: Not worth the $6.20. The matcha flavour is super diluted and just tastes like milk. I will say that the way they prepare the drink is great though since the matcha tasted smooth rather than powdery. …"
            },
            {
                "reviewName": "Grace K",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Great little tea shop, very cozy atmosphere. The Chrysanthemun pu er milk tea is really great, as well the Matcha latte is impressive. Back room is a large tea \"dining room\" of sorts and a small front patio to facilitate people watching."
            },
            {
                "reviewName": "Shailendra Shukla",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "I had Matcha latte, with a colleague and it was really tasty. A quarter sugar added the slight and perfected amount of sugar. I loved the way they prepared it in front of me and explained about it too. …"
            },
            {
                "reviewName": "Benjamin Wang (X.B.X)",
                "reviewRating": 5,
                "reviewDate": "a month ago",
                "reviewMessage": "Matcha latte with soy milk! Awesome!"
            },
            {
                "reviewName": "Melissa Wong",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Came in 30 mins before closing which is really too bad- this is the perfect little place to quietly write in my journal. I had a matcha latte and the tofu black sesame cheesecake! Sooooo yummy \ud83d …"
            },
            {
                "reviewName": "Daniel Francavilla",
                "reviewRating": 5,
                "reviewDate": "5 months ago",
                "reviewMessage": "… nice addition to their original location on Spadina, with lots of seating available. The same very high-quality matcha and tea products. (You get what you pay for). Always reliable. Offers dairy-free milk options. Amazing iced matcha latte."
            },
            {
                "reviewName": "Nancy Li",
                "reviewRating": 5,
                "reviewDate": "10 months ago",
                "reviewMessage": "Amazing new store, beautiful skylights. Matcha latte tastes the same, rich and smooth. Great place to meet up with friends"
            }
        ],
        "Rose Jasmine Tea": [
            {
                "reviewName": "Daniel O'Brien (danomar13)",
                "reviewRating": 5,
                "reviewDate": "7 months ago",
                "reviewMessage": "… quality, but they steep it to order which guarantee's its freshness. Definitely one of the best spots for tea in Toronto and I would highly recommend trying it at least once. I personally had the Rose Jasmine tea and it did not disappoint."
            },
            {
                "reviewName": "T",
                "reviewRating": 5,
                "reviewDate": "a week ago",
                "reviewMessage": "All their drinks are amazing. You can’t go wrong with any of them! My personal favs are the rose jasmine milk tea, matcha latte, and fresh taro milk! …"
            },
            {
                "reviewName": "J. L",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "My first visit there, I ordered in the front of the store, which offers your general milk teas, modern tea drinks, etc. …"
            },
            {
                "reviewName": "Yuxi Chen",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… teas and cheese foam teas. Served hot or iced and you can add toppings and adjust the sweetness level. Very reasonable prices (comparable to other chat times/bbt places) but better quality. We tried the rose jasmine and it was very fresh!"
            },
            {
                "reviewName": "Ha Pham",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… I ordered the rose jasmine tea, it was a little bland for me, I prefer my teas stronger. Not sure I would visit again but nice to try at least once. …"
            },
            {
                "reviewName": "Rachel Lung",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… Onto the product.  The Rose Jasmine tea is amaaazinggg.  I asked for the tea to have very little sugar in it and it still was delicious!  They were very accomodating with sugar levels, heat levels and topping additions. …"
            },
            {
                "reviewName": "phuong",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "Strong tea flavour, specifically had the iced rose jasmine tea which leans stronger on the jasmine than rose side. Tapioca is harder than OneZo and kind of clumps together."
            },
            {
                "reviewName": "Wu Yunong",
                "reviewRating": 5,
                "reviewDate": "10 months ago",
                "reviewMessage": "… they brew every cup of tea fresh to order. the environment is absolutely beautiful and elegant. highly recommend the rose jasmine milktea and the osmanthus，they infuse flower into their tea and it taste like the fresh blossoms…and their …"
            },
            {
                "reviewName": "Shir T",
                "reviewRating": 3,
                "reviewDate": "5 years ago",
                "reviewMessage": "… dont know if its my own taste buds.. but i thought it was okay, not incredibly great. I liked the rose jasmine tea flavor but the cheese foam really threw me off and i couldnt balance it back out because they didnt have pearls at the time."
            },
            {
                "reviewName": "Wenjing Niu",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Icha is for sure the Must-to-Try tea spot in DT toronto. Love their rose jasmine milk tea and deserts. It is really rare to find a tea store to homemade all their desserts in house. Sometimes they even have seasonal limited - edition drinks …"
            },
            {
                "reviewName": "Daniel O'Brien (danomar13)",
                "reviewRating": 5,
                "reviewDate": "7 months ago",
                "reviewMessage": "… quality, but they steep it to order which guarantee's its freshness. Definitely one of the best spots for tea in Toronto and I would highly recommend trying it at least once. I personally had the Rose Jasmine tea and it did not disappoint."
            },
            {
                "reviewName": "T",
                "reviewRating": 5,
                "reviewDate": "a week ago",
                "reviewMessage": "All their drinks are amazing. You can’t go wrong with any of them! My personal favs are the rose jasmine milk tea, matcha latte, and fresh taro milk! …"
            },
            {
                "reviewName": "J. L",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "My first visit there, I ordered in the front of the store, which offers your general milk teas, modern tea drinks, etc. …"
            },
            {
                "reviewName": "Yuxi Chen",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… teas and cheese foam teas. Served hot or iced and you can add toppings and adjust the sweetness level. Very reasonable prices (comparable to other chat times/bbt places) but better quality. We tried the rose jasmine and it was very fresh!"
            },
            {
                "reviewName": "Ha Pham",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… I ordered the rose jasmine tea, it was a little bland for me, I prefer my teas stronger. Not sure I would visit again but nice to try at least once. …"
            },
            {
                "reviewName": "Rachel Lung",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… Onto the product.  The Rose Jasmine tea is amaaazinggg.  I asked for the tea to have very little sugar in it and it still was delicious!  They were very accomodating with sugar levels, heat levels and topping additions. …"
            },
            {
                "reviewName": "phuong",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "Strong tea flavour, specifically had the iced rose jasmine tea which leans stronger on the jasmine than rose side. Tapioca is harder than OneZo and kind of clumps together."
            },
            {
                "reviewName": "Wu Yunong",
                "reviewRating": 5,
                "reviewDate": "10 months ago",
                "reviewMessage": "… they brew every cup of tea fresh to order. the environment is absolutely beautiful and elegant. highly recommend the rose jasmine milktea and the osmanthus，they infuse flower into their tea and it taste like the fresh blossoms…and their …"
            },
            {
                "reviewName": "Shir T",
                "reviewRating": 3,
                "reviewDate": "5 years ago",
                "reviewMessage": "… dont know if its my own taste buds.. but i thought it was okay, not incredibly great. I liked the rose jasmine tea flavor but the cheese foam really threw me off and i couldnt balance it back out because they didnt have pearls at the time."
            },
            {
                "reviewName": "Wenjing Niu",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Icha is for sure the Must-to-Try tea spot in DT toronto. Love their rose jasmine milk tea and deserts. It is really rare to find a tea store to homemade all their desserts in house. Sometimes they even have seasonal limited - edition drinks …"
            },
            {
                "reviewName": "Rocio Montoya-Campos",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "Love this little tea shop. Definitely a must see place in the city. It’s just so comfortable and cozy. I’d recommend the Jasmine rose tea (hot)"
            }
        ],
        "Roasted Oolong Milk Tea": [
            {
                "reviewName": "Nguyen Thu",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "I had a hot roasted oolong milk tea made with real tea leaf and real milk: nice strong tea and good balance of milk and sugar added. It is not too sweet compare to other brand. So 50% is good."
            },
            {
                "reviewName": "Q P",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Stumbled across this little shop on our walk, ordered the roasted oolong milk tea with tapioca. Loved that I can have it without ice and have less sugar. The staff is super friendly and love the environment as well! Would love to come back!"
            },
            {
                "reviewName": "T yuan",
                "reviewRating": 2,
                "reviewDate": "4 years ago",
                "reviewMessage": "Pretty expensive for one size only. Roasted oolong milk tea tasted diluted. Pearls have a strange gummy texture."
            },
            {
                "reviewName": "Christina V",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Nice place! Got the hot Roasted Oolong Milk Tea for $5.88 including tax."
            },
            {
                "reviewName": "Nguyen Thu",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "I had a hot roasted oolong milk tea made with real tea leaf and real milk: nice strong tea and good balance of milk and sugar added. It is not too sweet compare to other brand. So 50% is good."
            },
            {
                "reviewName": "Q P",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Stumbled across this little shop on our walk, ordered the roasted oolong milk tea with tapioca. Loved that I can have it without ice and have less sugar. The staff is super friendly and love the environment as well! Would love to come back!"
            },
            {
                "reviewName": "T yuan",
                "reviewRating": 2,
                "reviewDate": "4 years ago",
                "reviewMessage": "Pretty expensive for one size only. Roasted oolong milk tea tasted diluted. Pearls have a strange gummy texture."
            },
            {
                "reviewName": "Christina V",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Nice place! Got the hot Roasted Oolong Milk Tea for $5.88 including tax."
            }
        ],
        "Classic Milk Tea": [
            {
                "reviewName": "Johnson",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "The classic milk tea and strawberry matcha latte were both very good. They have a specialized tea bar for those into that. The interior is very relaxing and would be a great place to study or relax. Employees were friendly and gave us our …"
            },
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… around. Very clean and comfortable and great for hanging out. Aside from the interior, we got the classic milk tea with tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable …"
            },
            {
                "reviewName": "heyyoumen1",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Had their Classic Milk Tea bubble tea, the tea was quite smooth, and their sweetness level leans a bit to the low side compare to every other bubble tea place, so keep that in mind. The back lounge area was moody and a lot of people work …"
            },
            {
                "reviewName": "Alex Gomez",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Classic milk tea is my favorite!"
            },
            {
                "reviewName": "Johnson",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "The classic milk tea and strawberry matcha latte were both very good. They have a specialized tea bar for those into that. The interior is very relaxing and would be a great place to study or relax. Employees were friendly and gave us our …"
            },
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… around. Very clean and comfortable and great for hanging out. Aside from the interior, we got the classic milk tea with tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable …"
            },
            {
                "reviewName": "heyyoumen1",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Had their Classic Milk Tea bubble tea, the tea was quite smooth, and their sweetness level leans a bit to the low side compare to every other bubble tea place, so keep that in mind. The back lounge area was moody and a lot of people work …"
            },
            {
                "reviewName": "Alex Gomez",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Classic milk tea is my favorite!"
            }
        ],
        "Osmanthus Oolong Tea": [
            {
                "reviewName": "Efe A",
                "reviewRating": 5,
                "reviewDate": "2 months ago",
                "reviewMessage": "The Osmanthus Oolong with milk and cream cheese was delicious. The tea bar was not open to my surprise."
            },
            {
                "reviewName": "Kris Buzmion",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "The vibes of the place is definitely a good place to chill and hang out. I tried their Iced Crafted Tea -- Iced Osmanthus Oolong Milk Tea. It's everything that is promised. Earthy, fresh, just enough creaminess -- perfect for the weather! I …"
            },
            {
                "reviewName": "Diane",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… I can see myself studying or just coming here by myself. It is a little pricey here, I got a Osmanthus Oolong Milk Tea with soy milk and it came to around $7 after tax. The drinks are very fresh and the tapioca tastes different from other …"
            },
            {
                "reviewName": "one.more.booster",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… We walked in and bought the whole dessert menu \"Matcha Roll\", \"Sesame Tofu Cheesecake\", 'Osmanthus Cheesecake\", \"Mung Bean Cake Taro\", \"Green Tea Brownie\" \"Rose Jasmine Pudding\" and the \"Oolong Pineapple Mochi\". It was probably the most …"
            },
            {
                "reviewName": "Efe A",
                "reviewRating": 5,
                "reviewDate": "2 months ago",
                "reviewMessage": "The Osmanthus Oolong with milk and cream cheese was delicious. The tea bar was not open to my surprise."
            },
            {
                "reviewName": "Kris Buzmion",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "The vibes of the place is definitely a good place to chill and hang out. I tried their Iced Crafted Tea -- Iced Osmanthus Oolong Milk Tea. It's everything that is promised. Earthy, fresh, just enough creaminess -- perfect for the weather! I …"
            },
            {
                "reviewName": "Diane",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… I can see myself studying or just coming here by myself. It is a little pricey here, I got a Osmanthus Oolong Milk Tea with soy milk and it came to around $7 after tax. The drinks are very fresh and the tapioca tastes different from other …"
            },
            {
                "reviewName": "one.more.booster",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… We walked in and bought the whole dessert menu \"Matcha Roll\", \"Sesame Tofu Cheesecake\", 'Osmanthus Cheesecake\", \"Mung Bean Cake Taro\", \"Green Tea Brownie\" \"Rose Jasmine Pudding\" and the \"Oolong Pineapple Mochi\". It was probably the most …"
            }
        ],
        "Brown Sugar Ginger Tea": [
            {
                "reviewName": "Kelly Bennett",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "grabbed the brown sugar ginger tea and the peach oolong. the line was long but it was very quick! the teas are made with a lot of care. very delicious!"
            },
            {
                "reviewName": "Karishma Chand",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… relaxing and calm the atmosphere was. Just so subtle and welcoming. We both ordered the Brown Sugar Ginger Milk tea and must I say, amazing! I love how soothing tea was and how they prepare the tea. More of a natural, homemade style. …"
            },
            {
                "reviewName": "Bonnie Yang",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Good atmosphere brown sugar ginger milk tea is really good"
            },
            {
                "reviewName": "Emmanuel Freddy",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Amazing ginger brown sugar tea"
            },
            {
                "reviewName": "Chau Johnsen Kelly",
                "reviewRating": 5,
                "reviewDate": "5 days ago",
                "reviewMessage": "Small shop, amazing tea! Had peach oolong and brown sugar ginger milk tea, both hot. Loved watching the tea brew on the spot, and then decanted into our cups. We took the tea to-go, but there’s also a nice tea room to enjoy a leisurely sit …"
            },
            {
                "reviewName": "Kelly Bennett",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "grabbed the brown sugar ginger tea and the peach oolong. the line was long but it was very quick! the teas are made with a lot of care. very delicious!"
            },
            {
                "reviewName": "Karishma Chand",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… relaxing and calm the atmosphere was. Just so subtle and welcoming. We both ordered the Brown Sugar Ginger Milk tea and must I say, amazing! I love how soothing tea was and how they prepare the tea. More of a natural, homemade style. …"
            },
            {
                "reviewName": "Bonnie Yang",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Good atmosphere brown sugar ginger milk tea is really good"
            },
            {
                "reviewName": "Emmanuel Freddy",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Amazing ginger brown sugar tea"
            },
            {
                "reviewName": "Chau Johnsen Kelly",
                "reviewRating": 5,
                "reviewDate": "5 days ago",
                "reviewMessage": "Small shop, amazing tea! Had peach oolong and brown sugar ginger milk tea, both hot. Loved watching the tea brew on the spot, and then decanted into our cups. We took the tea to-go, but there’s also a nice tea room to enjoy a leisurely sit …"
            }
        ],
        "Taro Milk Tea": [
            {
                "reviewName": "Marjolaine G",
                "reviewRating": 4,
                "reviewDate": "4 months ago",
                "reviewMessage": "Friendly and quick service. I had the taro ice tea for a caffeine free alternative which is essentially blended taro with milk (I used oat milk). Good but would not order again - try their actual teas instead. …"
            },
            {
                "reviewName": "T",
                "reviewRating": 5,
                "reviewDate": "a week ago",
                "reviewMessage": "All their drinks are amazing. You can’t go wrong with any of them! My personal favs are the rose jasmine milk tea, matcha latte, and fresh taro milk! …"
            },
            {
                "reviewName": "Jag Singh",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Awesome awesome awesome! Love the traditional tea, and the taro milk tea! Desserts are killer"
            },
            {
                "reviewName": "one.more.booster",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… We walked in and bought the whole dessert menu \"Matcha Roll\", \"Sesame Tofu Cheesecake\", 'Osmanthus Cheesecake\", \"Mung Bean Cake Taro\", \"Green Tea Brownie\" \"Rose Jasmine Pudding\" and the \"Oolong Pineapple Mochi\". It was probably the most …"
            },
            {
                "reviewName": "Patty Wong",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Got the Fresh Taro Milk tea and it was really made with fresh taro. I could taste the taro root bits."
            },
            {
                "reviewName": "Annie",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "The hot Taro Milk tea is a must-try!"
            },
            {
                "reviewName": "Christina Nguyen",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "the Taro Milk Tea here is incredible"
            },
            {
                "reviewName": "Marjolaine G",
                "reviewRating": 4,
                "reviewDate": "4 months ago",
                "reviewMessage": "Friendly and quick service. I had the taro ice tea for a caffeine free alternative which is essentially blended taro with milk (I used oat milk). Good but would not order again - try their actual teas instead. …"
            },
            {
                "reviewName": "T",
                "reviewRating": 5,
                "reviewDate": "a week ago",
                "reviewMessage": "All their drinks are amazing. You can’t go wrong with any of them! My personal favs are the rose jasmine milk tea, matcha latte, and fresh taro milk! …"
            },
            {
                "reviewName": "Jag Singh",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Awesome awesome awesome! Love the traditional tea, and the taro milk tea! Desserts are killer"
            },
            {
                "reviewName": "one.more.booster",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… We walked in and bought the whole dessert menu \"Matcha Roll\", \"Sesame Tofu Cheesecake\", 'Osmanthus Cheesecake\", \"Mung Bean Cake Taro\", \"Green Tea Brownie\" \"Rose Jasmine Pudding\" and the \"Oolong Pineapple Mochi\". It was probably the most …"
            },
            {
                "reviewName": "Patty Wong",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Got the Fresh Taro Milk tea and it was really made with fresh taro. I could taste the taro root bits."
            },
            {
                "reviewName": "Annie",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "The hot Taro Milk tea is a must-try!"
            },
            {
                "reviewName": "Christina Nguyen",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "the Taro Milk Tea here is incredible"
            },
            {
                "reviewName": "Jade Hilton",
                "reviewRating": 5,
                "reviewDate": "a month ago",
                "reviewMessage": "The best milk tea in the city! They use real taro… no sugary powders!"
            }
        ],
        "Chrysanthemum Tea W. Pearls": [],
        "Iced Green Tea Latte": [],
        "Petal Jasmine Tea": [
            {
                "reviewName": "Jay",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Icha Tea is a different kind of tea shop.  it's take the concept of drip coffee which is all the rage now and applies it to the traditional tea process. …"
            },
            {
                "reviewName": "Jay",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Icha Tea is a different kind of tea shop.  it's take the concept of drip coffee which is all the rage now and applies it to the traditional tea process. …"
            }
        ],
        "Chrysanthemum Pure Crafted Milk Tea": [],
        "Iced Milk Tea": [
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… around. Very clean and comfortable and great for hanging out. Aside from the interior, we got the classic milk tea with tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable …"
            },
            {
                "reviewName": "Yuxi Chen",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… on the menu from more traditional tea to milk teas and cheese foam teas. Served hot or iced and you can add toppings and adjust the sweetness level. Very reasonable prices (comparable to other chat times/bbt places) but better quality. We …"
            },
            {
                "reviewName": "Kris Buzmion",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "The vibes of the place is definitely a good place to chill and hang out. I tried their Iced Crafted Tea -- Iced Osmanthus Oolong Milk Tea. It's everything that is promised. Earthy, fresh, just enough creaminess -- perfect for the weather! I …"
            },
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… around. Very clean and comfortable and great for hanging out. Aside from the interior, we got the classic milk tea with tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable …"
            },
            {
                "reviewName": "Yuxi Chen",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… on the menu from more traditional tea to milk teas and cheese foam teas. Served hot or iced and you can add toppings and adjust the sweetness level. Very reasonable prices (comparable to other chat times/bbt places) but better quality. We …"
            },
            {
                "reviewName": "Kris Buzmion",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "The vibes of the place is definitely a good place to chill and hang out. I tried their Iced Crafted Tea -- Iced Osmanthus Oolong Milk Tea. It's everything that is promised. Earthy, fresh, just enough creaminess -- perfect for the weather! I …"
            },
            {
                "reviewName": "Daniel Francavilla",
                "reviewRating": 5,
                "reviewDate": "5 months ago",
                "reviewMessage": "… nice addition to their original location on Spadina, with lots of seating available. The same very high-quality matcha and tea products. (You get what you pay for). Always reliable. Offers dairy-free milk options. Amazing iced matcha latte."
            }
        ],
        "Jasmine Green Tea": [
            {
                "reviewName": "Yunhan Liu",
                "reviewRating": 5,
                "reviewDate": "5 months ago",
                "reviewMessage": "… black/herbal/green/white tea to choose from and some asian desserts. We also tried the pudding and the sesame tofu cheesecake which paired well with the floral jasmine tea we ordered. The prices are expensive for tea - paid 16$ for 2 but …"
            },
            {
                "reviewName": "Kerry Wah",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… I ordered the jasmine green tea from the menu, and the girl behind the bar proceeded to make my tea, starting with steeping the tea leaves.  She poured the tea from one container to another repeatedly, feeling the temperature of the …"
            },
            {
                "reviewName": "one.more.booster",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… We walked in and bought the whole dessert menu \"Matcha Roll\", \"Sesame Tofu Cheesecake\", 'Osmanthus Cheesecake\", \"Mung Bean Cake Taro\", \"Green Tea Brownie\" \"Rose Jasmine Pudding\" and the \"Oolong Pineapple Mochi\". It was probably the most …"
            },
            {
                "reviewName": "Yunhan Liu",
                "reviewRating": 5,
                "reviewDate": "5 months ago",
                "reviewMessage": "… black/herbal/green/white tea to choose from and some asian desserts. We also tried the pudding and the sesame tofu cheesecake which paired well with the floral jasmine tea we ordered. The prices are expensive for tea - paid 16$ for 2 but …"
            },
            {
                "reviewName": "Kerry Wah",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… I ordered the jasmine green tea from the menu, and the girl behind the bar proceeded to make my tea, starting with steeping the tea leaves.  She poured the tea from one container to another repeatedly, feeling the temperature of the …"
            },
            {
                "reviewName": "one.more.booster",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… We walked in and bought the whole dessert menu \"Matcha Roll\", \"Sesame Tofu Cheesecake\", 'Osmanthus Cheesecake\", \"Mung Bean Cake Taro\", \"Green Tea Brownie\" \"Rose Jasmine Pudding\" and the \"Oolong Pineapple Mochi\". It was probably the most …"
            }
        ],
        "Matcha Milk Tea": [
            {
                "reviewName": "Michelle Lee",
                "reviewRating": 5,
                "reviewDate": "7 months ago",
                "reviewMessage": "A very classy and quaint Japanese tea shop. …"
            },
            {
                "reviewName": "Johnson",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "The classic milk tea and strawberry matcha latte were both very good. They have a specialized tea bar for those into that. The interior is very relaxing and would be a great place to study or relax. Employees were friendly and gave us our …"
            },
            {
                "reviewName": "Jinchen Cai",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Amazing Bubble Tea Shop with very well-designed interiors! 🍵 🧋 Definately reccomend the matcha drinks as it's their specialTEA 😉 Also all milk tea are made with freshly steeped tea on the sp …"
            },
            {
                "reviewName": "T",
                "reviewRating": 5,
                "reviewDate": "a week ago",
                "reviewMessage": "All their drinks are amazing. You can’t go wrong with any of them! My personal favs are the rose jasmine milk tea, matcha latte, and fresh taro milk! …"
            },
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… around. Very clean and comfortable and great for hanging out. Aside from the interior, we got the classic milk tea with tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable …"
            },
            {
                "reviewName": "J. L",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "My first visit there, I ordered in the front of the store, which offers your general milk teas, modern tea drinks, etc. …"
            },
            {
                "reviewName": "Grace Jin",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "The matcha swiss roll and black sesame tofu cheesecake were amazing!! Flavours were intense, not too sweet, and cakes were moist and fluffy. …"
            },
            {
                "reviewName": "Grace K",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Great little tea shop, very cozy atmosphere. The Chrysanthemun pu er milk tea is really great, as well the Matcha latte is impressive. Back room is a large tea \"dining room\" of sorts and a small front patio to facilitate people watching."
            },
            {
                "reviewName": "Mika C",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… They really made sure I liked my drink since I was trying something new. They also put so much effort towards the tea and the quality of the matcha they use. They also have soy milk options for their bubble tea for the vegans and lactose …"
            },
            {
                "reviewName": "A Cartier",
                "reviewRating": 3,
                "reviewDate": "4 years ago",
                "reviewMessage": "3.5 stars ... they draw of handmade Matcha latte from real matcha powder drew me in.  Good service keeps this spot above other bubble tea cafe in Toronto. …"
            },
            {
                "reviewName": "Michelle Lee",
                "reviewRating": 5,
                "reviewDate": "7 months ago",
                "reviewMessage": "A very classy and quaint Japanese tea shop. …"
            },
            {
                "reviewName": "Johnson",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "The classic milk tea and strawberry matcha latte were both very good. They have a specialized tea bar for those into that. The interior is very relaxing and would be a great place to study or relax. Employees were friendly and gave us our …"
            },
            {
                "reviewName": "Jinchen Cai",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Amazing Bubble Tea Shop with very well-designed interiors! 🍵 🧋 Definately reccomend the matcha drinks as it's their specialTEA 😉 Also all milk tea are made with freshly steeped tea on the sp …"
            },
            {
                "reviewName": "T",
                "reviewRating": 5,
                "reviewDate": "a week ago",
                "reviewMessage": "All their drinks are amazing. You can’t go wrong with any of them! My personal favs are the rose jasmine milk tea, matcha latte, and fresh taro milk! …"
            },
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… around. Very clean and comfortable and great for hanging out. Aside from the interior, we got the classic milk tea with tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable …"
            },
            {
                "reviewName": "J. L",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "My first visit there, I ordered in the front of the store, which offers your general milk teas, modern tea drinks, etc. …"
            },
            {
                "reviewName": "Grace Jin",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "The matcha swiss roll and black sesame tofu cheesecake were amazing!! Flavours were intense, not too sweet, and cakes were moist and fluffy. …"
            },
            {
                "reviewName": "Grace K",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Great little tea shop, very cozy atmosphere. The Chrysanthemun pu er milk tea is really great, as well the Matcha latte is impressive. Back room is a large tea \"dining room\" of sorts and a small front patio to facilitate people watching."
            },
            {
                "reviewName": "Mika C",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… They really made sure I liked my drink since I was trying something new. They also put so much effort towards the tea and the quality of the matcha they use. They also have soy milk options for their bubble tea for the vegans and lactose …"
            },
            {
                "reviewName": "A Cartier",
                "reviewRating": 3,
                "reviewDate": "4 years ago",
                "reviewMessage": "3.5 stars ... they draw of handmade Matcha latte from real matcha powder drew me in.  Good service keeps this spot above other bubble tea cafe in Toronto. …"
            },
            {
                "reviewName": "Daniel Francavilla",
                "reviewRating": 5,
                "reviewDate": "5 months ago",
                "reviewMessage": "A nice addition to their original location on Spadina, with lots of seating available. The same very high-quality matcha and tea products. (You get what you pay for). Always reliable. Offers dairy-free milk options. Amazing iced matcha …"
            }
        ],
        "White Peach Oolong": [
            {
                "reviewName": "SARAH JING",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Great environment and fantastic treats. Must try their white peach oolong milk foam tea~"
            },
            {
                "reviewName": "SARAH JING",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Great environment and fantastic treats. Must try their white peach oolong milk foam tea~"
            }
        ],
        "Milk Bubble Tea": [
            {
                "reviewName": "Claire Hoon",
                "reviewRating": 5,
                "reviewDate": "5 months ago",
                "reviewMessage": "Now, most bubble tea places here taste the same because they use the same type of powder and juice for their (milk) teas. However, you can truly experience the taste of real tea at ICHA TEA. It's clear that they use quality tea leaves to …"
            },
            {
                "reviewName": "Diana Nguyen",
                "reviewRating": 5,
                "reviewDate": "4 months ago",
                "reviewMessage": "… idea of paradise. Quaint place to enjoy a proper cup of tea, where I can read or work. I had the milk oolong tea set where I had unlimited hot water for my leaves. They also have bubble tea which I hope to try next time. It can get noisy …"
            },
            {
                "reviewName": "Jinchen Cai",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Amazing Bubble Tea Shop with very well-designed interiors! 🍵 🧋 Definately reccomend the matcha drinks as it's their specialTEA 😉 Also all milk tea are made with freshly steeped tea on the sp …"
            },
            {
                "reviewName": "Tracy Tran",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… for couple time. The first time was very impressive. Good milk tea, I ordered Oolong milk tea with 50% sweet. Personally, their 50% sweet is quite mild to me, I had to mix my friend's one (100%) to have better flavor. Plus, the tea they …"
            },
            {
                "reviewName": "Alice Z",
                "reviewRating": 3,
                "reviewDate": "8 months ago",
                "reviewMessage": "Had bubble tea from here, it is my ideal Milk tea taste. Not overly sweet, and has a strong tea taste. …"
            },
            {
                "reviewName": "Debbie Lee",
                "reviewRating": 3,
                "reviewDate": "5 years ago",
                "reviewMessage": "Nice little tea shop on spadina. Can't wait to try their actual tea experience. Bubble tea is decent. If you're gonna get the bubble tea, do it without the milk so you can taste the fragrance of the tea"
            },
            {
                "reviewName": "Mika C",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… towards the tea and the quality of the matcha they use. They also have soy milk options for their bubble tea for the vegans and lactose intolerant people out there. The place itself is so peaceful and comfortable! I highly recommend it …"
            },
            {
                "reviewName": "Polina Orlova",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… this place. Stands out from the bubble tea crowd with its focus oh high quality teas. You can have traditional tea, milk tea, and cheese foam tea: whatever you wish really. The place is spacious and calm. The staff are …"
            },
            {
                "reviewName": "heyyoumen1",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Had their Classic Milk Tea bubble tea, the tea was quite smooth, and their sweetness level leans a bit to the low side compare to every other bubble tea place, so keep that in mind. The back lounge area was moody and a lot of people work …"
            },
            {
                "reviewName": "Diane",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… I can see myself studying or just coming here by myself. It is a little pricey here, I got a Osmanthus Oolong Milk Tea with soy milk and it came to around $7 after tax. The drinks are very fresh and the tapioca tastes different from other …"
            },
            {
                "reviewName": "Claire Hoon",
                "reviewRating": 5,
                "reviewDate": "5 months ago",
                "reviewMessage": "Now, most bubble tea places here taste the same because they use the same type of powder and juice for their (milk) teas. However, you can truly experience the taste of real tea at ICHA TEA. It's clear that they use quality tea leaves to …"
            },
            {
                "reviewName": "Diana Nguyen",
                "reviewRating": 5,
                "reviewDate": "4 months ago",
                "reviewMessage": "… idea of paradise. Quaint place to enjoy a proper cup of tea, where I can read or work. I had the milk oolong tea set where I had unlimited hot water for my leaves. They also have bubble tea which I hope to try next time. It can get noisy …"
            },
            {
                "reviewName": "Jinchen Cai",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Amazing Bubble Tea Shop with very well-designed interiors! 🍵 🧋 Definately reccomend the matcha drinks as it's their specialTEA 😉 Also all milk tea are made with freshly steeped tea on the sp …"
            },
            {
                "reviewName": "Tracy Tran",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… for couple time. The first time was very impressive. Good milk tea, I ordered Oolong milk tea with 50% sweet. Personally, their 50% sweet is quite mild to me, I had to mix my friend's one (100%) to have better flavor. Plus, the tea they …"
            },
            {
                "reviewName": "Alice Z",
                "reviewRating": 3,
                "reviewDate": "8 months ago",
                "reviewMessage": "Had bubble tea from here, it is my ideal Milk tea taste. Not overly sweet, and has a strong tea taste. …"
            },
            {
                "reviewName": "Debbie Lee",
                "reviewRating": 3,
                "reviewDate": "5 years ago",
                "reviewMessage": "Nice little tea shop on spadina. Can't wait to try their actual tea experience. Bubble tea is decent. If you're gonna get the bubble tea, do it without the milk so you can taste the fragrance of the tea"
            },
            {
                "reviewName": "Mika C",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… towards the tea and the quality of the matcha they use. They also have soy milk options for their bubble tea for the vegans and lactose intolerant people out there. The place itself is so peaceful and comfortable! I highly recommend it …"
            },
            {
                "reviewName": "Polina Orlova",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… this place. Stands out from the bubble tea crowd with its focus oh high quality teas. You can have traditional tea, milk tea, and cheese foam tea: whatever you wish really. The place is spacious and calm. The staff are …"
            },
            {
                "reviewName": "heyyoumen1",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Had their Classic Milk Tea bubble tea, the tea was quite smooth, and their sweetness level leans a bit to the low side compare to every other bubble tea place, so keep that in mind. The back lounge area was moody and a lot of people work …"
            },
            {
                "reviewName": "Diane",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… I can see myself studying or just coming here by myself. It is a little pricey here, I got a Osmanthus Oolong Milk Tea with soy milk and it came to around $7 after tax. The drinks are very fresh and the tapioca tastes different from other …"
            }
        ],
        "Black Milk Tea": [
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable because you can really taste the black tea flavour and it's quite high quality. Tapioca was nice and chewy. Would recommend …"
            },
            {
                "reviewName": "Grace Jin",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "The matcha swiss roll and black sesame tofu cheesecake were amazing!! Flavours were intense, not too sweet, and cakes were moist and fluffy. …"
            },
            {
                "reviewName": "j j",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "Rose dian hong black milk tea was nice :)"
            },
            {
                "reviewName": "G W",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… tapioca and iced matcha latte with tapioca. Both drinks were wonderfully made, the less sugar option is preferable because you can really taste the black tea flavour and it's quite high quality. Tapioca was nice and chewy. Would recommend …"
            },
            {
                "reviewName": "Grace Jin",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "The matcha swiss roll and black sesame tofu cheesecake were amazing!! Flavours were intense, not too sweet, and cakes were moist and fluffy. …"
            },
            {
                "reviewName": "j j",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "Rose dian hong black milk tea was nice :)"
            }
        ]
    },
    "Chatime": {
        "Roasted Milk Tea": [],
        "Brown Sugar Pearl Milk Tea": [],
        "Matcha Tea Latte": []
    },
    "Bubble Lee": {
        "Pearl Milk Tea": [
            {
                "reviewName": "Ha Phan Tran",
                "reviewRating": 5,
                "reviewDate": "8 months ago",
                "reviewMessage": "Narrow selection but there brown sugar pearl is so good. Try their soy or Jasmine tea with Milk and brownsugar bubble."
            }
        ],
        "Iced Tea": [
            {
                "reviewName": "Harsh Patel",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "… I wanted bubble milk tea. However they had many options which confused me. I asked the cashier for her recommendation. She recommended jasmine iced tea. The tea was refreshing. Tapioca was sweet, soft but chewy. A lot of places have Tapioca …"
            },
            {
                "reviewName": "Jerus Zhang",
                "reviewRating": 1,
                "reviewDate": "8 months ago",
                "reviewMessage": "… . Ok. I ordered another drink then. When I got home, the other one I got (iced lychee tea) has a broken package and spilled my clothes. What a disaster. I called them again, but got just cold reply: we can give you another one. No …"
            }
        ],
        "Brown Sugar Boba Milk Tea": [
            {
                "reviewName": "Winnie Jiang",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Absolutely loved it! Went there yesterday and ordered a Brown Sugar Boba Black Milk Tea +30%. The milk tea itself was very delicious, texture of their boba was perfect with rich brown sugar flavour. Cost approx. $6.80 after tax which was a …"
            }
        ],
        "Lemon Jasmine Tea": []
    },
    "Yi Fang Taiwan Fruit Tea": {
        "Yi Fang Fruit Tea": [
            {
                "reviewName": "Brian Ko (Particleman11)",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "This was the first fruit tea place I tried after landing in Toronto and I have to say I made a good call. I got their signature drink, the Yi Fang fruit tea. It has apple and orange slices in it, and you can adjust the sweetness level. I …"
            },
            {
                "reviewName": "Jacy Newfeld",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "… for different flavour profiles.  I got a mango pomelo sago slush which was refreshing and delicious, and my partner got the Yi Fang fruit tea, which came with real fruit and was tart and tasty.  Will definitely be coming back!"
            },
            {
                "reviewName": "A n",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "With all the new stores opening in Chinatown, it's really difficult to stand out, but Yi Fang manages to execute and deliver amazing bubble tea. Having tried several items on the menu, I recommend their signature fruit tea and black sugar …"
            },
            {
                "reviewName": "W",
                "reviewRating": 1,
                "reviewDate": "4 months ago",
                "reviewMessage": "I did some research before trying this tea shop out as it stood out from the others because their main feature was using \"jam\" as their special ingredient but unfortunately after taking two sips, I found the tea to be nauseatingly sweet. It …"
            },
            {
                "reviewName": "Eckogen",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "… customization options are available here. Worried about your sugar intake? Just ask for less. They do not use powdered flavouring to make the teas. Yi Fang Taiwain Fruit Tea offers quality drinks, using fresh ingredients and soft tapioca."
            },
            {
                "reviewName": "Aspyn DeAngelis",
                "reviewRating": 1,
                "reviewDate": "6 months ago",
                "reviewMessage": "… The fruit tea it’s alright. …"
            },
            {
                "reviewName": "Feriko Tjhia",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Wanted to try Yi Fang for a long time and finally got the chance to. Was really impressed because of the refreshing fruit tea."
            },
            {
                "reviewName": "Monica Mak",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "This place is a must try!!! :D I had the Yi Fang Fruit Tea and the Mango Fruit Tea, both were extremely good and addictive. I loved the fruit puree and fresh fruit in the drinks. It felt healthy even though I was having a treat. Definitely …"
            },
            {
                "reviewName": "Jenny",
                "reviewRating": 4,
                "reviewDate": "5 months ago",
                "reviewMessage": "… We went back for their new promotional drink. It was a very good deal at $4.99 (Regular Size). The Mango Pomelo Sago Slush was very refreshing. We enjoyed this fruity drink very much. …"
            },
            {
                "reviewName": "DK Lo",
                "reviewRating": 4,
                "reviewDate": "2 months ago",
                "reviewMessage": "… and super pleasant atmosphere. Bright, friendly attendees, a I'm good quality teas. I absolutely recommend the signature signature Yi Fang fruit tea as this is extremely refreshing (with pineapple essence and apples and passionfruit seeds). …"
            },
            {
                "reviewName": "Vonny Wong",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "I passed by Yi Fang the other day and was surprised by how many people were going in and out of this place! The space right now is quite small, as they have blocked off the seating area, allowing customers to only be in the ordering area. I …"
            },
            {
                "reviewName": "Vera Zhou",
                "reviewRating": 1,
                "reviewDate": "7 months ago",
                "reviewMessage": "… place that won’t let you add a topping unless you get a large size. I ordered the Yi Fang fruit tea and I found the tea was too strong to compliment the fruit. The cashier girl was also snappy when I assumed they had coconut jelly, which …"
            },
            {
                "reviewName": "T.",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Excellent fruit teas. We got the pineapple green tea with aiyu jelly and the Jinfeng roselle lemon slice juice. …"
            },
            {
                "reviewName": "Sabrina",
                "reviewRating": 1,
                "reviewDate": "6 months ago",
                "reviewMessage": "… one I’ve ever had. As much as I love Yi Fang’s drinks, there is no way im returning to this place ever again :) There are many other good fruit tea places with nice staff and good service, I’d rather not to spend money just to ruin my day. …"
            }
        ],
        "Signature Fruit Tea": [
            {
                "reviewName": "Brian Ko (Particleman11)",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "This was the first fruit tea place I tried after landing in Toronto and I have to say I made a good call. I got their signature drink, the Yi Fang fruit tea. It has apple and orange slices in it, and you can adjust the sweetness level. I …"
            },
            {
                "reviewName": "Quinn Ha",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Great place to stop by for quality bubble tea with friendly staff that'll help you order if you're undecided! Their signature fruit tea and their pearl black tea latte are my favorite :) …"
            },
            {
                "reviewName": "A n",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… to execute and deliver amazing bubble tea. Having tried several items on the menu, I recommend their signature fruit tea and black sugar pearl latte (available at 3pm and 7pm for a limited quantity). You can even watch the staff as they …"
            },
            {
                "reviewName": "Alexander Seto",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "Their signature fruit tea is very refreshing! Would definitely recommend as something to drink on a hot day!"
            },
            {
                "reviewName": "Maggielicious To",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "This place always have a lineup. The reason why the line moves so slow is probably because they only have 1 menu on the wall and the English is in tiny font....my fav is still the signature fruit tea. The Tapioca in the milk tea was too …"
            },
            {
                "reviewName": "Yang Xu",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "The signature fruit tea is my favorite. Also I like the wall decor, very good for taking selfies XD"
            },
            {
                "reviewName": "Betty W. Ng",
                "reviewRating": 4,
                "reviewDate": "11 months ago",
                "reviewMessage": "Ordered their new year combo and came to the store to pick up. Friendly service. We enjoyed their egg cakes and the signature fruit tea."
            },
            {
                "reviewName": "Erin Xie",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Love the drinks at this location and the good service! Got 4 today and they gave me a little boba keychain, super cute 🥰 Drinks wise we recommend the taro milk green tea, mango pomelo and signature fruit tea …"
            },
            {
                "reviewName": "DK Lo",
                "reviewRating": 4,
                "reviewDate": "2 months ago",
                "reviewMessage": "… and super pleasant atmosphere. Bright, friendly attendees, a I'm good quality teas. I absolutely recommend the signature signature Yi Fang fruit tea as this is extremely refreshing (with pineapple essence and apples and passionfruit seeds). …"
            }
        ],
        "Black Tea Latte": [
            {
                "reviewName": "lydia",
                "reviewRating": 5,
                "reviewDate": "6 months ago",
                "reviewMessage": "Most high quality and consistent bubble tea place, the black tea latte w/ pearls is so good every time and they have the best pudding topping of all the bbt chains (it’s actually egg-y and rich like real flan). The guy working behind the …"
            },
            {
                "reviewName": "Quinn Ha",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Great place to stop by for quality bubble tea with friendly staff that'll help you order if you're undecided! Their signature fruit tea and their pearl black tea latte are my favorite :) …"
            },
            {
                "reviewName": "A n",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "… to execute and deliver amazing bubble tea. Having tried several items on the menu, I recommend their signature fruit tea and black sugar pearl latte (available at 3pm and 7pm for a limited quantity). You can even watch the staff as they …"
            },
            {
                "reviewName": "Denise Niu",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… YiFang Fruit Tea, it’s absolutely refreshing. But don’t forget to take a fork to eat the fruits. For the milk tea, I always get the black sugar one. Black sugar pearls blend well with the organic milk. If you would like to add another …"
            },
            {
                "reviewName": "an ni Chien",
                "reviewRating": 1,
                "reviewDate": "3 years ago",
                "reviewMessage": "We ordered black sugar peral latte yesterday, around 4pm. They told us that was the last cup(we order 7 cups in total). We were so happy and felt lucky. After drinking, we just realized that is not black sugar peral lattee. That just regual …"
            },
            {
                "reviewName": "Domy",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Fresh fruit and milk to make the fruit tea and milk tea.  Love their Black sugar Pearl Tea Latte so much!👌🏻👌 …"
            },
            {
                "reviewName": "Wang Chang Ling",
                "reviewRating": 1,
                "reviewDate": "3 years ago",
                "reviewMessage": "… incompetent to place the right order even after I mentioned to her verbally twice,referring to the picture on the menu(black tea latte and pearl black tea are in different colour),she also offered a normal size straw instead of a big one …"
            },
            {
                "reviewName": "Olivia Tang",
                "reviewRating": 1,
                "reviewDate": "2 years ago",
                "reviewMessage": "(Translated by Google) I order black tea latte with pudding today by delivery, but the pudding has already gone bad, which is like the dregs. Never come again and I suggest who can see this comment never come here for that. Also, the …"
            },
            {
                "reviewName": "Mindy Chen",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "… . Order desk and entrance to close, in this weather it’s way to cold. I tried there black sugar pearl latte. I’m not sure, didn’t really seem to taste tea or latte, it’s alittle lighter than other black sugar bbt I had before. It’s …"
            },
            {
                "reviewName": "Vonny Wong",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "… 1. Black sugar pearl black tea latte: I prefer this over the milk only version, as their tea is of good quality and adds another dimension in terms of taste. The tapioca surprised me since they were about half the usual size, reminding me …"
            }
        ],
        "Winter Melon Milk Tea": []
    },
    "Machi Machi": {
        "Cream Foam": [
            {
                "reviewName": "Yige Qu",
                "reviewRating": 1,
                "reviewDate": "3 months ago",
                "reviewMessage": "Ordered Oolong Tea with Cream Foam. …"
            },
            {
                "reviewName": "Lily Lai",
                "reviewRating": 5,
                "reviewDate": "11 months ago",
                "reviewMessage": "I love machi machi, whenever I’m near one I’ll get something. My go to order is the jasmine green tea with cream foam and mini taro balls, less sugar less ice. This is the greatest thing ever and I love it so much. I wish they had more …"
            },
            {
                "reviewName": "Wictoria li",
                "reviewRating": 1,
                "reviewDate": "3 years ago",
                "reviewMessage": "I ordered black milk tea with cream foam. It tasted sweater than milk tea with cream foam at other bubble tea stores. I mean only milk ...no tea taste...it is totally below my imagination. The wait time is 20 minutes. Maybe I went at 8:00PM …"
            },
            {
                "reviewName": "Carmen Tam",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… has probably been ironed out for the most part. They did get one of our drinks wrong, but quickly remade it and it tasted very fresh and flavourful (strawberry slush with cream foam). Would come back for more fruit drinks for sure. Oolong …"
            },
            {
                "reviewName": "Heidi Adia",
                "reviewRating": 3,
                "reviewDate": "a year ago",
                "reviewMessage": "Aesthetically pleasing location. Friendly staff. I tried the black milk tea with cream foam- pretty good, but not a favourite."
            },
            {
                "reviewName": "M CN",
                "reviewRating": 2,
                "reviewDate": "a year ago",
                "reviewMessage": "Toppings are not good and the sweetness is too artificial and they do not have  tapioca.\nThey give as to little cream foam with the oolong tea we ordered\nThe oolong tea is good though."
            },
            {
                "reviewName": "Livia Popa",
                "reviewRating": 5,
                "reviewDate": "2 weeks ago",
                "reviewMessage": "Wow!! So glad I tried something new! The menu is so unique! The grapefruit slush with cream foam and kanten jelly was delicious. Fresh, fruity, sweet, chewy… yum. Can adjust sweetness level, too, which is a plus. Wait was under 5 minutes. W …"
            },
            {
                "reviewName": "Andrew Siu",
                "reviewRating": 5,
                "reviewDate": "6 months ago",
                "reviewMessage": "… I ordered the Mochi Black Tea w/ Cream Foam. Although not pictured, they give you a small skewer of three mochi that pairs well with the drink. Unlike your typical mochi, it's a little denser and is reminiscent of a bao both in texture and …"
            },
            {
                "reviewName": "Kelly",
                "reviewRating": 5,
                "reviewDate": "8 months ago",
                "reviewMessage": "The strong oolong flavour perfectly complemented the coffee jello and cream foam 🤤 I love how there was both tea 🫖 and ☕️ flavours so you get a bit of both in this drink  …"
            },
            {
                "reviewName": "Ashley Sirgool",
                "reviewRating": 5,
                "reviewDate": "7 months ago",
                "reviewMessage": "I buy from here often. Other than their cream foam series they are 100% vegan. They use pea protein powder in place of milk which is amazing. My go to is definitely the mochi black with cream foam i definitely recommend. Their regular milk …"
            },
            {
                "reviewName": "Jeremy Wong",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "What a wonderful bubble tea place. We ordered the black tea with cream foam and mochi and the strawberry panne cotta bottle. …"
            },
            {
                "reviewName": "Jenny L",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Ordered fresh strawberry slush with cream foam and the signature hot mochi red bean brûlée matcha latte. Choose between 0%, 30%, 70% or full sugar. Decor is nice and the customer service was good. Will def come back next time to try other …"
            },
            {
                "reviewName": "Isaak",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "… Their milk tea tastes like it was made with real tea leaves not powder; their fruit juices and fizzy drinks are also a must try! My go-to is either the strawberry cream foam or the oolong milk tea with golden tapioca! …"
            },
            {
                "reviewName": "Caroline Jiang",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "Cute interior, drinks above average. Ordered mochi cream foam black tea, overall is not bad, but it tastes more like HongKong style milk tea to me."
            },
            {
                "reviewName": "Edison Huang",
                "reviewRating": 4,
                "reviewDate": "4 months ago",
                "reviewMessage": "… other. With that in mind… I ended up at Machi Machi instead because this isn’t available in the Bay Area. I ordered their Mochi black tea with cream foam 0% sugar and 0% ice. The drink has a nice strong tea flavor. The mochi …"
            },
            {
                "reviewName": "Verny Dinh",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "… . The different between kanten jelly and pearls is even when you keep your tea overnight in the fridge, kanten jell is still chewy and not hard like pearls! Their choices with cream foam are also great. However, it is a little bit pricey…"
            }
        ],
        "Fresh Strawberry Green Tea Slush": [],
        "Black Tea Latte": [
            {
                "reviewName": "Irene H",
                "reviewRating": 3,
                "reviewDate": "3 years ago",
                "reviewMessage": "… We got their Black MT w/ Panna Cotta & Strawberry Latte w/ Panna Cotta. Each bottle is around $8, and despite the bottle looking cute, it’s a bit expensive for just a plastic bottle in my opinion. The strawberry Latte tasted pretty good …"
            },
            {
                "reviewName": "Ziqi Lin",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Love it!!! The bottle is sooo cute. Black milk tea and strawberry latte is awesome. Wanna try crème brûlée next time!\ud83d …"
            },
            {
                "reviewName": "Karishma Rane",
                "reviewRating": 4,
                "reviewDate": "2 years ago",
                "reviewMessage": "Love their black tea pannacotta & the strawberry latte pannacotta"
            },
            {
                "reviewName": "Fabiana Martinez",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Machi Machi is definitely one of my favourite bubble tea stores 💓 I have been to this location several times and the taste and quality of the drinks are always on point plus the staff is friendly and efficient …"
            },
            {
                "reviewName": "Sam F",
                "reviewRating": 4,
                "reviewDate": "2 years ago",
                "reviewMessage": "I’ve ordered here a few times now and my favourite drink is the creme brûlée black milk tea with NO SUGAR. It’s sweet enough for me. The creme brûlée is nice and creamy with good flavour. I’ve also tried the bottle strawberry latte with …"
            },
            {
                "reviewName": "Daniel",
                "reviewRating": 5,
                "reviewDate": "4 months ago",
                "reviewMessage": "Ordered their Black Milk Tea with Crème Brulée and my girlfriend bought the Strawberry Latte with Panna Cotta. It was so tasty! We both loved the aesthetic of the shop and thoroughly enjoyed our drink. We came back the day afterwards for …"
            },
            {
                "reviewName": "Naomi Ly",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "I've tasted the Black Milk Tea with Panna Cotta before and it was delicious! This time I tried the Strawberry Latte with Panna Cotta and it tastes like a diluted strawberry slushy. …"
            },
            {
                "reviewName": "Kristin",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "… fruit tea options. This is a better place for people who prefer milk teas or milky drinks. I really enjoyed their wintermelon latte and black tea with cheese foam. Their tapioca is also super chewy and enjoyable to eat. The downside is that …"
            },
            {
                "reviewName": "Irfan Marzuki",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "… of beverages. You should definitely try out their panna cotta in the cute bottles at least once, but my favourites are the Black Milk Tea with Creme Brûlée (added mini taro balls- can be very sweet so drop the sugar) and the Handmade Brown …"
            },
            {
                "reviewName": "Shao Gu",
                "reviewRating": 3,
                "reviewDate": "a year ago",
                "reviewMessage": "Delicious Creme Brûlée Black Tea Latte - basically my favourite in Machi Machi. In other words, this is the only drink I know won’t regret lol. Fruit teas I’ve tried so far are mostly tasty because I added enough of sugar🥲 Tried their Fres …"
            },
            {
                "reviewName": "Frank Smith",
                "reviewRating": 4,
                "reviewDate": "2 years ago",
                "reviewMessage": "… good, at least they have something different like the Cream brulee  and the Fresh strawberry latte. The black milk tea tasted like red rose tea. Ordering was a bit time consuming with how some drinks can me modified and others can't. Was …"
            },
            {
                "reviewName": "Kristen C",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "… holidays for their cute little Santa hats that they put on the bottles. Tried their black tea latte with panna cotta, chocolate with pana cotta, and matcha with panna cotta. Out of the three, milk tea was the best since the matcha was a …"
            },
            {
                "reviewName": "EatIn Ontario",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "… the décor of the place itself, it was very unique and aesthetic. I ordered 2 drinks; a strawberry latte with Panna cotta and  Black milk tea with gold pearls. The presentation of the drinks were really pretty and definitely one of their …"
            },
            {
                "reviewName": "Kat Chan",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Ordered the strawberry latte w panna cotta, black milk tea w grass jelly, and Jasmine green tea w plum jello bottles.\n10/10 drinks\nJasmine green tea is by far my favourite so far!"
            },
            {
                "reviewName": "Riya D'souza",
                "reviewRating": 5,
                "reviewDate": "9 months ago",
                "reviewMessage": "Love their drinks. I have tried their fluffy strawberry latte with crème brûlée and black milk tea with crème brûlée. It's delicious."
            }
        ],
        "Creme Brulee Milk Tea": [
            {
                "reviewName": "Cindy N",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "The black milk tea with creme brulee is really tasty and overall cute vibe inside the store. However, a lot of the drinks is definitely on the more higher end price point."
            },
            {
                "reviewName": "Hao Chen",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Best bubble in town, the Black Milk Tea with Creme Brulee is amazing!"
            },
            {
                "reviewName": "Thao Anh Le",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "If it is your first time here, highly recommend the creme brulee back milktea, the red bean matcha with creme brulee and the strawberry pana cota. I think these are the most unique drinks in there selection. I love the creme brulee top. Mat …"
            },
            {
                "reviewName": "Margaret Loo",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Their drinks are absolutely delicious! Got the Strawberry Panna Cotta...and love the mini Christmas hat decoration. Super cute!\nAlso got the Black Milk Tea with Creme Brulee at 30% sugar. This drink is to die for! 😋 …"
            },
            {
                "reviewName": "Saif Ali Khoja",
                "reviewRating": 1,
                "reviewDate": "a year ago",
                "reviewMessage": "I got the black milk tea with creme brulee foam and golden tapioca. The milk tea taste pretty bland, tapioca was alright, and the foam had a weird taste about half way through. All this at a regular size for $8.90, don't listen to the hype."
            },
            {
                "reviewName": "Melissa Lee",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "The drinks are good very time I visit. The Black Milk Tea with Creme Brulee is very good. It was very sweet of them to hand write appreciation cards."
            },
            {
                "reviewName": "Joyce Jing",
                "reviewRating": 5,
                "reviewDate": "10 months ago",
                "reviewMessage": "Employee were very friendly. I asked the cashier to recommend drinks for me and she did so patiently. I got the black milk tea with creme brulee. Will definitely visit again."
            },
            {
                "reviewName": "Anna Yu",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Love their golden milk tea, and creme brulee one. The strawberry pana cotta one was tasty but kind of pricey for what it is."
            },
            {
                "reviewName": "Skye's Adventures",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Absolutely top notch customer service!\nPolite, Fast, and knowledgeable staff.\nDid i forget to mention they have the best creme brulee milk tea flavors?\nThey are abosultely 💣 …"
            },
            {
                "reviewName": "Liza Little",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "I never leave reviews but I was blown away by how good my drink was! I got a Matcha Red Bean Creme Brûlée Smoothie w/ Mochi (only at this location!) and it was delicious :)) I never get smoothies and always stick to a basic black tea or …"
            },
            {
                "reviewName": "Amanda Yang",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "The black milk tea with creme brulee is soooo good, my go to drink every time"
            },
            {
                "reviewName": "Isabelle Cho",
                "reviewRating": 4,
                "reviewDate": "4 weeks ago",
                "reviewMessage": "Staff was friendly. Got my drink quickly. My favourite is the creme brulee milk tea."
            },
            {
                "reviewName": "Maria Sobchuk",
                "reviewRating": 5,
                "reviewDate": "2 months ago",
                "reviewMessage": "The service was fast and friendly, creme brulee was delightful. Really-really good. Black tea with milk was what you expect it, a bit bitter since I ordered no sugar. Really nice idea with creme brulee topping! Recommend."
            }
        ]
    },
    "Baroness": {
        "Purple Yam Bubble Tea": []
    },
    "Real Fruit Bubble Tea": {},
    "CoCo Fresh Juice & Tea": {
        "Sago Taro Milk Tea": [
            {
                "reviewName": "Avik Dasgupta",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "I really like the Pearl milk tea and the sago taro milk tea here. One of the best bubble tea places in downtown Toronto."
            },
            {
                "reviewName": "Nicky Nicole",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Love the sago taro milk tea!!!"
            },
            {
                "reviewName": "Helen Le",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Everyone is great here and the taro sago milk tea is the best."
            },
            {
                "reviewName": "B B",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… There are the classic BBT! I love the passionfruit tea with grass jelly! There are many other options such as their matcha macchiato, sago taro milk tea, and their classic 3 Guys (milk tea with grass jelly, pearls, and tapioca). …"
            },
            {
                "reviewName": "Peter Nguyen",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Love their sago taro milk tea"
            }
        ],
        "Bubble Gaga": [
            {
                "reviewName": "Georgina",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "… I often have their Bubble Gaga, which is passion fruit with tapioca and coconut jelly bits, it’s super refreshing. You can also adjust your sweetness (as many drinks are normally very sweet) and ice amounts. …"
            },
            {
                "reviewName": "Carolina Uribe Montoya",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Love bubble Gaga, it's the best. My suggestion is to ask for cero sugaring it, it's not necessary."
            },
            {
                "reviewName": "Lumena Queiroz",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "I have ordered here for at least 30 times, I really like the Bubble Gaga and the Brown Sugar. The staff is always friendly and fast. I always recommend Coco to my friends. Thanks so much guys!"
            },
            {
                "reviewName": "Monika Solanki",
                "reviewRating": 1,
                "reviewDate": "3 years ago",
                "reviewMessage": "Every time when I order from here they mess up with my order. Yesterday I ordered bubble gaga and asked specifically not to add coconut jelly but add grass jelly. Guess what! they did charge me for grass jelly but instead they added coconut …"
            },
            {
                "reviewName": "Realistyazar “Cansu Yildiz Heo”",
                "reviewRating": 5,
                "reviewDate": "9 months ago",
                "reviewMessage": "You should try the bubble gaga its amazing. And cocos stuffs are always kind and smiling face."
            },
            {
                "reviewName": "Pinky Chan",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Quick service even during the promotion. I did not wait long and the line definitely moves quick. They currently have a promotion for $3.88 for bubble gaga and 2 ladies. Love both drinks and would recommend them."
            },
            {
                "reviewName": "E L",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "MUST HAVE BUBBLE GAGA! I had this drink first time in Shanghai. Wasn't able to get it with the actual passionfruit seeds again, anywhere even in Vancouver to my disappointment. But they do it right here. Authentic exactly the same as what I …"
            },
            {
                "reviewName": "Stripeless Tiger (Stripeless Tiger)",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "I personally recommend the Bubble Gaga, their coconut jelly is better than most bubble tea places around toronto. I frequently return here!"
            },
            {
                "reviewName": "Eunice Huang",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "(Translated by Google) I love bubble Gaga so much. …"
            },
            {
                "reviewName": "Carol F",
                "reviewRating": 4,
                "reviewDate": "11 months ago",
                "reviewMessage": "… In the past, we have ordered the Bubble Gaga, Passion Fruit Green Tea, Grapefruit Green Tea and Winter Melon Juice from this location. The quality and quantity are consistent with others in the chain. To make it easier, make sure you know …"
            },
            {
                "reviewName": "stephanie nguyen",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Nice place and have a lot of sitting areas to stay. I love Bubble Gaga and Mango Slush in here. The staff is very nice, friendly and willing to help us. Gonna come here frequently."
            },
            {
                "reviewName": "Aaron Harrison",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "The cashier was adorable and oh so kind. I got the Bubble GaGa. What makes this place amazing is the sugar and ice level customizations. Absolutely delicious!!!"
            },
            {
                "reviewName": "Helen Nadong Danez",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "I bought 4 large sizes (2 ladies, 3 buddies, bubble gaga, jasmine) and paid not more than CAD 25😳 not soo pricey  …"
            },
            {
                "reviewName": "max wang",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Bubble Gaga is a must try drink in summer. They accept phone orders. Save my time. \ud83d …"
            },
            {
                "reviewName": "jessica huang",
                "reviewRating": 2,
                "reviewDate": "9 months ago",
                "reviewMessage": "… Tonight Order From Uber , there is a drink call bubble gaga has 2 topping inside, I wrote a request like \"can you only put one of the topping?I don't like pearls.  \". And they just reject my order! …"
            },
            {
                "reviewName": "stylesz Smith",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… inside in the hot weather is not an option. However, there is a nice, small patio there to enjoy your beverage. One of my favourites is the Bubble GaGa but there are many good choices. I'm going to try some more of the Milk Teas as well."
            },
            {
                "reviewName": "Carol F",
                "reviewRating": 5,
                "reviewDate": "3 months ago",
                "reviewMessage": "… Overall, beverages are pretty consistent with the other Coco locations! We've tried the bubble gaga and grapefruit green tea. The add-ons for grass jelly and sago are our go-to! Delicious and good to go for a Coco bubble tea!"
            },
            {
                "reviewName": "LiNi F",
                "reviewRating": 5,
                "reviewDate": "4 months ago",
                "reviewMessage": "Ordered the bubble gaga, it was amazing. Passion fruit flavour’s tea with tapioca and coconut jelly. Love it 🥰. (Their staffs were great too, friendly and helpful for explaining the drinks for me. Btw, the service was pretty fast …"
            },
            {
                "reviewName": "Irene Wu",
                "reviewRating": 5,
                "reviewDate": "4 months ago",
                "reviewMessage": "I ordered bubble Gaga, and that was perfect! Great service and also fast! I didn’t even wait for my drink, I got it almost right away! And taste is so great!! Best bubble tea shop in Downtown!"
            },
            {
                "reviewName": "Max Park",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Not the most spacious location but that comes with being downtown. The bubble tea in CoCo is always fresh and great. I love the Bubble Gaga and 2 Ladies."
            },
            {
                "reviewName": "Carlos McGregor",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Tried the Bubble Gaga passion fruit bubble tea. It was ideal for these hot days. …"
            },
            {
                "reviewName": "Andrea B",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Good bubble tea. My favourites are bubble Gaga and 2 ladies. Never disappointed."
            },
            {
                "reviewName": "Marco Giovanetti",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Great. First time trying a bubble tea. Had the bubble gaga. Like having a fruit juice with jelly beans."
            },
            {
                "reviewName": "qristi aranda",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Bubble gaga is one amazing you should try!"
            },
            {
                "reviewName": "Michael Vincent",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Get the Bubble Gaga, you won't regret the decision."
            },
            {
                "reviewName": "Tyler Ramsay",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "The bubble gaga was spectacular"
            },
            {
                "reviewName": "krupali sharma",
                "reviewRating": 1,
                "reviewDate": "2 years ago",
                "reviewMessage": "Do not try : bubble gaga from\nHere it was so bad in taste and no sugar was in it , all was sour"
            },
            {
                "reviewName": "kmila Prado",
                "reviewRating": 4,
                "reviewDate": "2 years ago",
                "reviewMessage": "This place is amazing great service.I love the bubble  gaga"
            },
            {
                "reviewName": "Alastaiir B",
                "reviewRating": 5,
                "reviewDate": "2 weeks ago",
                "reviewMessage": "(Translated by Google) bubble gaga is delicious! ! 🙂\n\n(Original)\nbubble gaga很好喝！！ …"
            },
            {
                "reviewName": "唔知",
                "reviewRating": 1,
                "reviewDate": "2 years ago",
                "reviewMessage": "… it opened. At the beginning, I would buy four or five cups every two days, but every time there was a problem, bubble gaga actually forgot to put sugar, red bean milk tea had too much milk tea powder, and I threw a few away. I have a …"
            }
        ],
        "Lemon King": [
            {
                "reviewName": "Andrew “Smitty” Smith",
                "reviewRating": 4,
                "reviewDate": "6 years ago",
                "reviewMessage": "Got a Lemon King because of the promotion. Not necessarily bubble tea but it was still realllyyy good. Not as many options as some places but its pretty high quality. Nice seating a decor."
            },
            {
                "reviewName": "Maria Chaplick",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "Lemon king is bomb"
            },
            {
                "reviewName": "Eric Choi",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Lemon king!"
            },
            {
                "reviewName": "Belinda Jin",
                "reviewRating": 3,
                "reviewDate": "5 years ago",
                "reviewMessage": "… super busy. It has big line up already. We have ordered  SMALL MANGO GREEN TEA WITH GRASS JELLO, LARGE CHOCOLATE MILK TEA + PEARL, LEMON KING +  COCONUT JELLO, and TAPIOCA CHOCOLATE. There are two sizes of the drinks. The large one …"
            },
            {
                "reviewName": "Mark Betonio",
                "reviewRating": 5,
                "reviewDate": "7 months ago",
                "reviewMessage": "I've been to other locations but, first time visiting this one.  The quality is the same as the rest of them, very good quality.  Had the King Lemon, a nice drink on a hot and humid day"
            },
            {
                "reviewName": "samar patel",
                "reviewRating": 5,
                "reviewDate": "5 days ago",
                "reviewMessage": "Such a cute little store with so many drink options to choose from. We chose mango yakult and the lemon king fruit tea. Both were delicious!"
            },
            {
                "reviewName": "Jen Ho",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Delay with one of the pumps. Ordered the lemon king for the first time with 30% sugar.  It was ok, not sure if the odd taste was too much sweetness or tart from the lemon.\n\nGood service and it's a nice small clean space"
            },
            {
                "reviewName": "K T",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… in Shanghai. Recently they have been popping up everywhere in the GTA. I really like the Pudding Milk Tea, Green Tea Matcha Milk Tea and Lemon King. However, always get half sweet because Coco is really sweet for me. Open pretty late …"
            },
            {
                "reviewName": "Trevor Lau",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Lots of flavours. Best for non-milk teas and isn't as packed as other places but just as good. Lemon king is dericious \ud83d …"
            },
            {
                "reviewName": "Minh Tú Trần",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Quick service, i got King Lemon drink with white tapioca. It tasted good. Thumb ups for it. \ud83d …"
            }
        ],
        "Black Tea Macchiato": [
            {
                "reviewName": "Wentao Run",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Tried their black tea macchiato.  Pretty good"
            },
            {
                "reviewName": "Anmie Luu",
                "reviewRating": 1,
                "reviewDate": "7 months ago",
                "reviewMessage": "… and treated us like we begged them for a free drink. I ordered Black Tea Macchiato with regular sugar and no ice, but they gave me the drink with no sugar and regular ice. Even though they already confirmed my order. I don’t understand how …"
            },
            {
                "reviewName": "Cha Nai",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "I visited this location this afternoon. The service is awesome, also the price is amazing too! I had black tea macchiato and sago mango green tea. The total price is 7.3dollar.  It’s really cheap in downtown. The second floor is spacious …"
            },
            {
                "reviewName": "HAN NGUYEN",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "I really like black tea macchiato. The staffs is very friendly"
            },
            {
                "reviewName": "Anjeleo Villarruz",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "I'm in love with the Coco. Pretty sure I come often enough that I'm a regular in this place, favourite drinks being: Mango Slush with Yakult, Black Tea Macchiato and Sago Taro."
            }
        ],
        "Matcha Milk Tea": [
            {
                "reviewName": "Denise Kovac",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "My favorites are red bean matcha milk tea, grapefruit Yakult, and lemon Yakult (not in the picture). There could be line ups at times, but service is really fast so you'll be enjoying your bubble tea before you know it."
            },
            {
                "reviewName": "Georgina",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Really nice bubble tea and juice bar with unique and tasty drinks: they have trendy drinks, mango slush drinks, cold matcha tea lattes, chocolate milk teas, and juices. …"
            },
            {
                "reviewName": "B",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… is her correct name) always remembers me and my boyfriends orders and genuinely seems interested in conversation. She’s amazing! I love the Matcha Milk tea here and always find myself coming here at the end of the night when I’m on Bloor St"
            },
            {
                "reviewName": "Susana Uribe Montoya",
                "reviewRating": 5,
                "reviewDate": "6 years ago",
                "reviewMessage": "Love the flavor, great service. My favourite is  Matcha milk tea"
            },
            {
                "reviewName": "Sar",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Yummy Taro milk tea and matcha red bean drinks."
            },
            {
                "reviewName": "K HONG",
                "reviewRating": 1,
                "reviewDate": "a month ago",
                "reviewMessage": "Is this Matcha milk bubble tea? The price is wrong, too. I drunk this at a discount event two days ago. …"
            },
            {
                "reviewName": "Kimberly Simbajon",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "I Always recommend cocos to my friends. Their tapioca tastes really good. Fave drink so far: matcha milk tea with tapioca and pudding"
            },
            {
                "reviewName": "B B",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… There are the classic BBT! I love the passionfruit tea with grass jelly! There are many other options such as their matcha macchiato, sago taro milk tea, and their classic 3 Guys (milk tea with grass jelly, pearls, and tapioca). …"
            },
            {
                "reviewName": "K T",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "… in Shanghai. Recently they have been popping up everywhere in the GTA. I really like the Pudding Milk Tea, Green Tea Matcha Milk Tea and Lemon King. However, always get half sweet because Coco is really sweet for me. Open pretty late …"
            },
            {
                "reviewName": "Reed Rider",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Very popular place that always has a line. Large selection of drinks! I tried the matcha milk tea for the first time and even though the flavor didnt click for me, i do love this place."
            },
            {
                "reviewName": "Ajin Mahenthiran (Gin)",
                "reviewRating": 1,
                "reviewDate": "3 months ago",
                "reviewMessage": "Ordered a matcha red bean milk tea with another drink and right after we payed for it I asked hey could I also add Boba in the matcha one as I forgot before I payed. I even offered to tap again but she asked if they could do that and to her …"
            }
        ],
        "Roasted Milk Tea": [
            {
                "reviewName": "Mary C",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Had a roasted milk tea with grass jelly. It was refreshing!"
            },
            {
                "reviewName": "Rob Silversmith",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Roasted milk tea, half sugar, no ice, fantastic."
            },
            {
                "reviewName": "Ivy Yu",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Finally, a great bubble tea place at Yonge and Eglinton. The service is very good. The bubble tea is really good as well. Try the roasted milk tea if you haven't had it before."
            },
            {
                "reviewName": "realitybeforeus",
                "reviewRating": 1,
                "reviewDate": "2 years ago",
                "reviewMessage": "Didnt give ANY pudding in the Two Ladies order, and roasted milk tea did not have any tea flavour. Less ice means more water"
            },
            {
                "reviewName": "Zoe Liu",
                "reviewRating": 3,
                "reviewDate": "a month ago",
                "reviewMessage": "Roasted milk tea w/ pearl, grass jelly, pudding 🫠(nothing impressiv …"
            },
            {
                "reviewName": "H G",
                "reviewRating": 4,
                "reviewDate": "2 years ago",
                "reviewMessage": "Keeping cool with the roasted milk tea. I enjoyed the grass jelly"
            },
            {
                "reviewName": "Halmon Lui",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Got the roasted milk tea which was excellent for a sub freezing day."
            },
            {
                "reviewName": "Carol L",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "prefer the roasted milk tea here vs the other major brand!"
            },
            {
                "reviewName": "MxL",
                "reviewRating": 2,
                "reviewDate": "5 years ago",
                "reviewMessage": "… Good to see that they still offer the roasted milk tea even if the sign says limited time offer for May."
            },
            {
                "reviewName": "Duncan Yang",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Extremely good bubble tea.  I usually get the classic milk tea or the roasted milk tea with sago."
            },
            {
                "reviewName": "Jimmy Nguyen",
                "reviewRating": 1,
                "reviewDate": "2 years ago",
                "reviewMessage": "… new location but training and the quantity of topping should be same as other location. I have ordered a large roasted milk tea with red bean the other day. The quantity of red bean was even less than in a regular size from other location. …"
            }
        ],
        "Mixed Juice Macchiato": [],
        "Caramel Milk Tea": [
            {
                "reviewName": "C Alexander (yorksgiftworld)",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "A little expensive but the taste is fantastic! I tried the Grapefruit Green Tea and Caramel Milk Tea. But were very delicious."
            },
            {
                "reviewName": "James Gauthier",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Was told to check this place out. Went in and was not disappointed. Got some caramel milk tea with the pearls and also a slush. Both were delicious and very reasonable prices plus the service was really good and quick."
            },
            {
                "reviewName": "Ishrat Trishna",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Love their sago pearls, the only place I have found in the downtown core. Their caramel milk tea with sago pearls is delicious!"
            },
            {
                "reviewName": "Ishra Aroni",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Caramel milk tea is dreamy"
            },
            {
                "reviewName": "Alex Thien",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Good bubble tea, my favourite place for milk tea. I like caramel milk tea and strawberry series."
            },
            {
                "reviewName": "Jason Eon",
                "reviewRating": 5,
                "reviewDate": "7 months ago",
                "reviewMessage": "Delicious caramel milk tea with kind staff and no seating limit!"
            },
            {
                "reviewName": "Princess Teeh",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "My top favorite bbt place! My fave drink here is brown sugar milk tea and the caramel milk tea :)"
            }
        ],
        "Grass Jelly Milk Tea": [
            {
                "reviewName": "Hannah Greiner",
                "reviewRating": 4,
                "reviewDate": "3 years ago",
                "reviewMessage": "Very delicious bubble tea here! My favourite is the Three Guys (milk tea with bubbles, custard and grass jelly). I find their teas are sweet enough with only 50% sweetener. I love going here for a special treat! If you are a part of their …"
            },
            {
                "reviewName": "Nancy Nguyen",
                "reviewRating": 5,
                "reviewDate": "6 years ago",
                "reviewMessage": "… Tastewise - I've had a lot of HK milk tea at places like Chatime and other small bubble tea places but I honestly love it here!! Just sweet enough for my taste and not too bland. …"
            },
            {
                "reviewName": "Mary C",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Had a roasted milk tea with grass jelly. It was refreshing!"
            },
            {
                "reviewName": "Kar-Wing Koo",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Classic tea base bbts. My go to for straight milk tea and tapioca. The 3guys drink is solid as well, (milk tea, yellow pudding, grass jelly)."
            },
            {
                "reviewName": "Ivy Lim",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Great milk tea! Loves the combi of tapioca, pudding and grass jelly!"
            },
            {
                "reviewName": "Zoe Liu",
                "reviewRating": 3,
                "reviewDate": "a month ago",
                "reviewMessage": "Roasted milk tea w/ pearl, grass jelly, pudding 🫠(nothing impressiv …"
            },
            {
                "reviewName": "River K",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "… good selection of drinks, from milk teas to smoothies. Good price for what you get. I usually end up getting the taro milk tea with regular sugar and less ice. I also recommend 3 Guys if you like toppings like grass jelly and pudding."
            },
            {
                "reviewName": "Lu Pagayonan",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Love the 3 guys milk tea. Tapioca balls are always made perfectly not too soggy not too firm.  Grass jelly and pudding toppings are good too!  You can also choose how much ice or sugar you want in your bubble tea!"
            },
            {
                "reviewName": "H G",
                "reviewRating": 4,
                "reviewDate": "2 years ago",
                "reviewMessage": "Keeping cool with the roasted milk tea. I enjoyed the grass jelly"
            },
            {
                "reviewName": "Miranda Chan",
                "reviewRating": 2,
                "reviewDate": "5 years ago",
                "reviewMessage": "Huge fan of cocotea but not this location. One good thing about this location is that it is big and has a nice sit down area.... however, the service was slow and the staff were either rude or moved at a slow glacial pace while chatting …"
            },
            {
                "reviewName": "Kelly Stone",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "First time to CoCo and first time ever trying milk tea and I loved it!!! I got the taro tea with grass jelly, I definitely recommend trying it. The line moved pretty fast and there was seats to sit and enjoy your drink."
            },
            {
                "reviewName": "B B",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "… There are the classic BBT! I love the passionfruit tea with grass jelly! There are many other options such as their matcha macchiato, sago taro milk tea, and their classic 3 Guys (milk tea with grass jelly, pearls, and tapioca). …"
            },
            {
                "reviewName": "Chia Chang",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "I really enjoyed grass jelly milk tea."
            }
        ],
        "Mango Slush": [
            {
                "reviewName": "Georgina",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Really nice bubble tea and juice bar with unique and tasty drinks: they have trendy drinks, mango slush drinks, cold matcha tea lattes, chocolate milk teas, and juices. …"
            },
            {
                "reviewName": "Ahsan Wahid",
                "reviewRating": 5,
                "reviewDate": "5 years ago",
                "reviewMessage": "Great consistent place for some great drinks! The mango slush is amazing!"
            },
            {
                "reviewName": "Hassan Awan",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Best bubble tea shop on Queen street. Loved the taro bubble tea and fresh mango slush. Eeal fruit slushes are always fresh and yummy. Highly recommended."
            },
            {
                "reviewName": "Brahim BMZO",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "The people with bad reviews might have their own reasons, I tried the Passion Fruit & Mango Slush and I can't complain, just OK."
            },
            {
                "reviewName": "captain hyderabad",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "I love the mango and passion fruit slush"
            },
            {
                "reviewName": "stephanie nguyen",
                "reviewRating": 5,
                "reviewDate": "3 years ago",
                "reviewMessage": "Nice place and have a lot of sitting areas to stay. I love Bubble Gaga and Mango Slush in here. The staff is very nice, friendly and willing to help us. Gonna come here frequently."
            },
            {
                "reviewName": "David Ritchie",
                "reviewRating": 5,
                "reviewDate": "2 years ago",
                "reviewMessage": "Service was fast (was on my break) passion fruit mango slush was awesome. Great prices too!"
            },
            {
                "reviewName": "Paige-Ruby Dorman",
                "reviewRating": 5,
                "reviewDate": "a year ago",
                "reviewMessage": "Queue was long but the mango slush made it so worth it!"
            },
            {
                "reviewName": "Michelle K",
                "reviewRating": 4,
                "reviewDate": "5 months ago",
                "reviewMessage": "The Coco’s at Y&F quality is most consistent out of all their locations I have tried. It is always busy here but they get the drinks done quick. I really like the 2 ladies & Mango Slush\ud83d …"
            },
            {
                "reviewName": "Leonard E",
                "reviewRating": 4,
                "reviewDate": "a year ago",
                "reviewMessage": "… One Mango Slush + Yakult please and thank you; make it quick! …"
            },
            {
                "reviewName": "K Lim",
                "reviewRating": 4,
                "reviewDate": "5 years ago",
                "reviewMessage": "… lined up mid-day. People lined up early evening. Why? Because probably one of the best places for bubble tea. Our favourite is the Mango slush with tapioca. Super fresh and tasty. We order with 50% less sugar as Mango is sweet enough."
            },
            {
                "reviewName": "Anjeleo Villarruz",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "I'm in love with the Coco. Pretty sure I come often enough that I'm a regular in this place, favourite drinks being: Mango Slush with Yakult, Black Tea Macchiato and Sago Taro."
            },
            {
                "reviewName": "Jack Yin",
                "reviewRating": 4,
                "reviewDate": "4 years ago",
                "reviewMessage": "Mango slush passed the test. Service was slow during a major rush. Could be faster."
            },
            {
                "reviewName": "Sara Farrukh Saeed",
                "reviewRating": 5,
                "reviewDate": "4 years ago",
                "reviewMessage": "Good variety of bubble teas and slush. I tried the mango slush. It was refreshing."
            }
        ]
    }
}